In [450]:
import os
from pathlib import Path

import pandas as pd

DATA_DIR = Path(os.environ["RAW_DATA_DIR"])

# Population (race, sex, age)

## 1980

### data wrangling

In [451]:
pop = pd.read_csv(
    DATA_DIR / "pop_1980.csv", skiprows=5, header=0
)  # first couple rows are informational text about csv
pop = pop.drop(0)  # first row empty
pop

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
188456,1989.0,56045.0,White female,227.0,308.0,268.0,226.0,140.0,205.0,289.0,...,209.0,187.0,165.0,162.0,153.0,148.0,120.0,86.0,63.0,52.0
188457,1989.0,56045.0,Black male,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188458,1989.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188459,1989.0,56045.0,Other races male,4.0,1.0,2.0,4.0,9.0,4.0,2.0,...,0.0,2.0,3.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0
188460,1989.0,56045.0,Other races female,3.0,5.0,4.0,4.0,4.0,5.0,6.0,...,2.0,7.0,6.0,3.0,1.0,0.0,0.0,1.0,0.0,0.0

In [452]:
pop_1980 = pop.query("`Year of Estimate` == 1980")
pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18842,1980.0,56045.0,White female,337.0,291.0,284.0,286.0,316.0,318.0,239.0,...,198.0,164.0,166.0,176.0,137.0,126.0,90.0,70.0,41.0,48.0
18843,1980.0,56045.0,Black male,0.0,0.0,0.0,1.0,2.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18844,1980.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18845,1980.0,56045.0,Other races male,4.0,6.0,8.0,5.0,8.0,4.0,3.0,...,2.0,2.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
18846,1980.0,56045.0,Other races female,8.0,8.0,7.0,4.0,6.0,6.0,3.0,...,3.0,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [453]:
# add total population column
cols_to_sum = list(pop_1980.columns)[3:]
pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)
pop_1980.head()

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_38492/3767407256.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0

In [454]:
pop_1980["FIPS State and County Codes"] = (
    pop_1980["FIPS State and County Codes"].astype(int).astype(str).str.zfill(5)
)
pop_1980.head()

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_38492/3185604704.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pop_1980['FIPS State and County Codes'] = pop_1980['FIPS State and County Codes'].astype(int).astype(str).str.zfill(5)

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
1,1980.0,01001,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0
2,1980.0,01001,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0
3,1980.0,01001,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0
4,1980.0,01001,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0
5,1980.0,01001,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0

In [455]:
chic = pop_1980.query("`FIPS State and County Codes` == '17031'")
chic

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
3631,1980.0,17031,White male,121332.0,118792.0,137303.0,160740.0,175922.0,171713.0,145158.0,...,93681.0,107394.0,108806.0,93515.0,72978.0,49137.0,31734.0,17901.0,11962.0,1825606.0
3632,1980.0,17031,White female,115801.0,113270.0,130679.0,154690.0,173379.0,165026.0,142886.0,...,97360.0,113210.0,118738.0,108650.0,95874.0,74896.0,56560.0,37566.0,28879.0,1940971.0
3633,1980.0,17031,Black male,64852.0,67189.0,68449.0,72304.0,59651.0,50616.0,41458.0,...,28176.0,27742.0,24734.0,18824.0,14698.0,10032.0,6393.0,3233.0,2092.0,624586.0
3634,1980.0,17031,Black female,63742.0,66547.0,68609.0,74392.0,73360.0,65333.0,54797.0,...,34945.0,34126.0,29889.0,23066.0,19321.0,14658.0,10258.0,5358.0,4057.0,726075.0
3635,1980.0,17031,Other races male,6294.0,5935.0,5112.0,4471.0,4882.0,6737.0,7667.0,...,3035.0,2320.0,2059.0,1491.0,1175.0,901.0,560.0,230.0,136.0,63610.0
3636,1980.0,17031,Other races female,5937.0,5484.0,4772.0,4244.0,5213.0,8455.0,8187.0,...,2909.0,2588.0,2272.0,1793.0,1405.0,930.0,595.0,373.0,238.0,65656.0

In [456]:
# only include msas in BFI dataset
bfi_df = pd.read_csv("../../data/the_rise_of_healthcare_jobs_disclosed_data_by_msa.csv")
bfi_df.head()

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,ln_aearn2022,change_earnings,college1980,college2022,change_college,healthcare_share_prime2022,healthcare_share_prime1980,change_non_hc_share_lbfr,change_ln_non_hc,non_hc_manu_share_prime_change
0,1,AL,0.006923,-0.01089,-0.01635,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,10.61,0.4585,0.07756,0.1600,0.08243,0.08564,0.03810,-0.05360,0.01936,0.088800
1,5,AR,-0.027700,-0.02280,-0.01652,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,10.61,0.4778,0.07879,0.1613,0.08254,0.08988,0.04074,-0.05038,0.02297,0.024760
2,6,CA,0.360200,-0.07647,-0.02523,0.080720,0.02098,-0.026890,0.12860,0.07481,...,10.89,0.5453,0.13910,0.2361,0.09704,0.06424,0.04326,-0.02911,0.38450,0.107610
3,8,CO,0.419600,-0.09702,-0.01325,0.087190,0.02308,0.008112,0.10220,0.03467,...,10.84,0.5516,0.15570,0.3569,0.20120,0.06779,0.04471,-0.02375,0.52890,0.079078
4,12,FL,0.463400,-0.05614,-0.00591,0.031780,0.03028,-0.065120,0.12720,0.09937,...,10.73,0.3837,0.14390,0.2902,0.14630,0.09054,0.06027,-0.03358,0.52410,0.096890

In [457]:
bfi_df["metro13"] = bfi_df["metro13"].astype(int).astype(str).str.zfill(5)

In [458]:
print(type(bfi_df["metro13"][0]))

<class 'str'>

In [459]:
# map county to msa
msa_county = pd.read_csv(DATA_DIR / "cbsatocountycrosswalk.csv", encoding="latin1")
msa_county["fips"] = msa_county["fipsstatecode"].astype(str).str.zfill(2) + msa_county[
    "fipscountycode"
].astype(str).str.zfill(3)
msa_county["cbsacode"] = msa_county["cbsacode"].astype(int).astype(str)
msa_county

,cbsacode,metropolitandivisioncode,csacode,cbsatitle,metropolitanmicropolitanstatis,metropolitandivisiontitle,csatitle,countycountyequivalent,statename,fipsstatecode,fipscountycode,centraloutlyingcounty,fips
0,33860,NaN,388.0,"Montgomery, AL",Metropolitan Statistical Area,NaN,"Montgomery-Selma, AL",Autauga County,Alabama,1,1,Central,01001
1,19300,NaN,380.0,"Daphne-Fairhope-Foley, AL",Metropolitan Statistical Area,NaN,"Mobile-Daphne-Fairhope, AL",Baldwin County,Alabama,1,3,Central,01003
2,21640,NaN,NaN,"Eufaula, AL-GA",Micropolitan Statistical Area,NaN,NaN,Barbour County,Alabama,1,5,Central,01005
3,13820,NaN,142.0,"Birmingham, AL",Metropolitan Statistical Area,NaN,"Birmingham-Cullman-Talladega, AL",Bibb County,Alabama,1,7,Outlying,01007
4,13820,NaN,142.0,"Birmingham, AL",Metropolitan Statistical Area,NaN,"Birmingham-Cullman-Talladega, AL",Blount County,Alabama,1,9,Outlying,01009
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1910,41980,NaN,490.0,"San Juan-BayamÃ³n-Caguas, PR",Metropolitan Statistical Area,NaN,"San Juan-BayamÃ³n, PR",Vega Alta Municipio,Puerto Rico,72,143,Central,72143
1911,41980,NaN,490.0,"San Juan-BayamÃ³n-Caguas, PR",Metropolitan Statistical Area,NaN,"San Juan-BayamÃ³n, PR",Vega Baja Municipio,Puerto Rico,72,145,Central,72145
1912,38660,NaN,434.0,"Ponce, PR",Metropolitan Statistical Area,NaN,"Ponce-Coamo, PR",Villalba Municipio,Puerto Rico,72,149,Outlying,72149
1913,41980,NaN,490.0,"San Juan-BayamÃ³n-Caguas, PR",Metropolitan Statistical Area,NaN,"San Juan-BayamÃ³n, PR",Yabucoa Municipio,Puerto Rico,72,151,Central,72151
1914,38660,NaN,434.0,"Ponce, PR",Metropolitan Statistical Area,NaN,"Ponce-Coamo, PR",Yauco Municipio,Puerto Rico,72,153,Outlying,72153

In [460]:
# add msa/cbsa codes to each county
msa_pop_1980 = pop_1980.merge(
    msa_county[["cbsacode", "fips", "cbsatitle"]],
    left_on="FIPS State and County Codes",
    right_on="fips",
    how="inner",
).drop(columns=["FIPS State and County Codes"])
msa_pop_1980

,Year of Estimate,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,35 to 39 years,...,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,cbsacode,fips,cbsatitle
0,1980.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,942.0,...,428.0,358.0,242.0,123.0,52.0,39.0,12394.0,33860,01001,"Montgomery, AL"
1,1980.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,1015.0,...,451.0,417.0,332.0,237.0,137.0,86.0,12482.0,33860,01001,"Montgomery, AL"
2,1980.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,120.0,...,126.0,128.0,87.0,70.0,31.0,13.0,3383.0,33860,01001,"Montgomery, AL"
3,1980.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,158.0,...,166.0,160.0,119.0,94.0,57.0,44.0,3810.0,33860,01001,"Montgomery, AL"
4,1980.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,3.0,...,0.0,1.0,0.0,0.0,0.0,0.0,48.0,33860,01001,"Montgomery, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10993,1980.0,White female,893.0,667.0,535.0,548.0,667.0,697.0,546.0,354.0,...,182.0,156.0,109.0,86.0,53.0,38.0,6483.0,21740,56041,"Evanston, WY-UT"
10994,1980.0,Black male,3.0,0.0,0.0,1.0,0.0,1.0,3.0,0.0,...,0.0,1.0,0.0,1.0,0.0,0.0,13.0,21740,56041,"Evanston, WY-UT"
10995,1980.0,Black female,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,1.0,0.0,0.0,0.0,4.0,21740,56041,"Evanston, WY-UT"
10996,1980.0,Other races male,0.0,6.0,2.0,5.0,6.0,6.0,1.0,3.0,...,1.0,0.0,0.0,0.0,0.0,0.0,40.0,21740,56041,"Evanston, WY-UT"
10997,1980.0,Other races female,2.0,4.0,2.0,6.0,6.0,4.0,5.0,5.0,...,1.0,0.0,0.0,0.0,1.0,0.0,42.0,21740,56041,"Evanston, WY-UT"

In [461]:
# keep only rows relevant to bfi dataset
merged_pop_1980 = msa_pop_1980.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="cbsacode",
    right_on="metro13",
    how="inner",
).drop(columns=["cbsacode", "cbsatitle"])
merged_pop_1980.head(10)

,Year of Estimate,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,35 to 39 years,...,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,fips,metro13,metro_title
0,1980.0,White male,410.0,535.0,549.0,550.0,468.0,462.0,416.0,440.0,...,229.0,221.0,204.0,126.0,71.0,35.0,5919.0,01007,13820,"Birmingham-Hoover, AL"
1,1980.0,White female,439.0,470.0,518.0,502.0,444.0,424.0,430.0,403.0,...,282.0,316.0,253.0,190.0,120.0,77.0,6147.0,01007,13820,"Birmingham-Hoover, AL"
2,1980.0,Black male,199.0,188.0,210.0,220.0,154.0,156.0,90.0,64.0,...,55.0,61.0,63.0,42.0,13.0,9.0,1717.0,01007,13820,"Birmingham-Hoover, AL"
3,1980.0,Black female,196.0,191.0,206.0,243.0,186.0,137.0,94.0,77.0,...,68.0,84.0,73.0,54.0,19.0,29.0,1948.0,01007,13820,"Birmingham-Hoover, AL"
4,1980.0,Other races male,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,4.0,01007,13820,"Birmingham-Hoover, AL"
5,1980.0,Other races female,0.0,0.0,0.0,3.0,3.0,0.0,0.0,1.0,...,0.0,1.0,1.0,0.0,0.0,0.0,10.0,01007,13820,"Birmingham-Hoover, AL"
6,1980.0,White male,1275.0,1473.0,1630.0,1716.0,1390.0,1320.0,1320.0,1199.0,...,761.0,733.0,566.0,333.0,160.0,89.0,17760.0,01009,13820,"Birmingham-Hoover, AL"
7,1980.0,White female,1228.0,1429.0,1470.0,1561.0,1299.0,1330.0,1362.0,1251.0,...,876.0,766.0,713.0,455.0,247.0,196.0,18102.0,01009,13820,"Birmingham-Hoover, AL"
8,1980.0,Black male,32.0,31.0,32.0,38.0,24.0,19.0,14.0,9.0,...,8.0,15.0,8.0,5.0,3.0,1.0,280.0,01009,13820,"Birmingham-Hoover, AL"
9,1980.0,Black female,26.0,31.0,30.0,39.0,29.0,26.0,17.0,12.0,...,11.0,14.0,6.0,9.0,4.0,6.0,317.0,01009,13820,"Birmingham-Hoover, AL"

In [462]:
# merge all fips rows into one according to msa and race/sex indicator
group_cols = [
    "Year of Estimate",
    "Race/Sex Indicator",
    "metro13",
    "metro_title",
]

# drop fips (county-level)
pop_1980_agg = (
    merged_pop_1980.drop(columns=["fips"])
    .groupby(group_cols, as_index=False)
    .sum(numeric_only=True)  # sums all the age + Total Population columns
)

pop_1980_agg

,Year of Estimate,Race/Sex Indicator,metro13,metro_title,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
0,1980.0,Black female,10420,"Akron, OH",2811.0,2909.0,2917.0,3479.0,3382.0,2803.0,...,1460.0,1537.0,1450.0,1086.0,933.0,680.0,445.0,255.0,238.0,32098.0
1,1980.0,Black female,10580,"Albany-Schenectady-Troy, NY",1328.0,1364.0,1580.0,1919.0,1676.0,1334.0,...,742.0,650.0,586.0,453.0,425.0,292.0,210.0,113.0,91.0,15598.0
2,1980.0,Black female,10740,"Albuquerque, NM",519.0,475.0,489.0,555.0,565.0,539.0,...,271.0,216.0,171.0,126.0,134.0,70.0,50.0,18.0,22.0,5153.0
3,1980.0,Black female,10900,"Allentown-Bethlehem-Easton, PA-NJ",442.0,498.0,476.0,526.0,445.0,435.0,...,178.0,204.0,150.0,145.0,116.0,62.0,61.0,23.0,24.0,4640.0
4,1980.0,Black female,12060,"Atlanta-Sandy Springs-Roswell, GA",26019.0,27190.0,28195.0,30990.0,32627.0,32811.0,...,12177.0,11208.0,9551.0,8877.0,8471.0,6300.0,4360.0,2251.0,1927.0,303884.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
547,1980.0,White male,47260,"Virginia Beach-Norfolk-Newport News, VA-NC",30858.0,30332.0,31304.0,44692.0,64187.0,42406.0,...,20123.0,20646.0,19983.0,15862.0,11328.0,7545.0,4369.0,2358.0,1418.0,437943.0
548,1980.0,White male,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",73880.0,79714.0,95810.0,106568.0,109462.0,114414.0,...,67079.0,64757.0,59493.0,46272.0,31240.0,21001.0,12237.0,6563.0,4494.0,1179618.0
549,1980.0,White male,48620,"Wichita, KS",17178.0,15307.0,15408.0,17942.0,21744.0,20925.0,...,10600.0,11193.0,10918.0,9076.0,6902.0,4959.0,3190.0,1902.0,1368.0,208646.0
550,1980.0,White male,49180,"Winston-Salem, NC",11114.0,13058.0,14608.0,15903.0,15449.0,15308.0,...,10171.0,10496.0,9646.0,7644.0,5930.0,4173.0,2596.0,1364.0,858.0,176806.0
551,1980.0,White male,49340,"Worcester, MA-CT",20504.0,22128.0,26495.0,30350.0,29171.0,25360.0,...,14125.0,15997.0,16327.0,14844.0,12169.0,8539.0,5627.0,3211.0,2361.0,304350.0

In [463]:
# table of total populations per msa
total_pop = merged_pop_1980.groupby(["metro13", "metro_title"], as_index=False)[
    "Total Population"
].sum()
total_pop = total_pop.rename(columns={"Total Population": "MSA Population"})
total_pop.head()

  metro13                        metro_title  MSA Population
0   10420                          Akron, OH        660527.0
1   10580        Albany-Schenectady-Troy, NY        772242.0
2   10740                    Albuquerque, NM        495477.0
3   10900  Allentown-Bethlehem-Easton, PA-NJ        636760.0
4   12060  Atlanta-Sandy Springs-Roswell, GA       2350072.0

In [464]:
msa_tables_1980 = {}

cats = [
    "White male",
    "Black male",
    "Other races male",
    "White female",
    "Black female",
    "Other races female",
]

agg = merged_pop_1980.groupby(["metro_title", "Race/Sex Indicator"], as_index=False)[
    "Total Population"
].sum()

for msa, g in agg.groupby("metro_title", sort=True):
    p = g.pivot_table(
        index="Race/Sex Indicator",
        values="Total Population",
        aggfunc="sum",
        fill_value=0,
    ).reindex(cats)

    # male totals & shares
    male_total = p.loc[["White male", "Black male", "Other races male"]].sum().item()
    male_white = 0 if male_total == 0 else p.loc["White male"].item() / male_total * 100
    male_black = 0 if male_total == 0 else p.loc["Black male"].item() / male_total * 100
    male_other = (
        0 if male_total == 0 else p.loc["Other races male"].item() / male_total * 100
    )

    # female totals & shares
    female_total = (
        p.loc[["White female", "Black female", "Other races female"]].sum().item()
    )
    female_white = (
        0 if female_total == 0 else p.loc["White female"].item() / female_total * 100
    )
    female_black = (
        0 if female_total == 0 else p.loc["Black female"].item() / female_total * 100
    )
    female_other = (
        0
        if female_total == 0
        else p.loc["Other races female"].item() / female_total * 100
    )

    proportions = pd.DataFrame(
        {
            "White": [male_white, female_white],
            "Black": [male_black, female_black],
            "Other": [male_other, female_other],
        },
        index=["Male", "Female"],
    ).round(2)

    msa_tables_1980[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    90.50   8.86   0.64
Female  89.95   9.41   0.65

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    95.38   3.79   0.84
Female  95.33   3.88   0.78

=== Albuquerque, NM ===
        White  Black  Other
Male    92.58   2.29   5.13
Female  92.49   2.04   5.48

=== Allentown-Bethlehem-Easton, PA-NJ ===
        White  Black  Other
Male    97.82   1.55   0.63
Female  98.01   1.41   0.59

=== Atlanta-Sandy Springs-Roswell, GA ===
        White  Black  Other
Male    76.01  23.25   0.74
Female  74.30  24.98   0.72

=== Augusta-Richmond County, GA-SC ===
        White  Black  Other
Male    66.73  32.45   0.82
Female  65.19  33.71   1.10

=== Austin-Round Rock, TX ===
        White  Black  Other
Male    88.83   9.76   1.40
Female  88.37  10.35   1.28

=== Bakersfield, CA ===
        White  Black  Other
Male    90.50   5.53   3.97
Female  90.88   5.29   3.83

=== Baltimore-Columbia-Towson, MD ===
        White  Black  Other
Male    73.91  24.85   1.24
Female  72.64  26.12   1.25

=== Baton Rouge, LA ===
        White  Black  Other
Male    68.93  30.41   0.66
Female  67.50  31.91   0.59

=== Birmingham-Hoover, AL ===
        White  Black  Other
Male    74.02  25.65   0.33
Female  72.29  27.37   0.34

=== Boise City, ID ===
        White  Black  Other
Male    98.00   0.39   1.61
Female  98.19   0.24   1.57

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    93.88   4.78   1.35
Female  93.94   4.83   1.23

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    89.84   9.00   1.16
Female  89.50   9.44   1.06

=== Cape Coral-Fort Myers, FL ===
        White  Black  Other
Male    91.57   8.03   0.40
Female  91.60   7.94   0.46

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    69.55  29.26   1.19
Female  65.96  32.81   1.22

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    78.89  20.37   0.74
Female  77.75  21.58   0.67

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    78.93  18.91   2.17
Female  77.46  20.44   2.11

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    89.22  10.24   0.55
Female  88.50  10.97   0.53

=== Colorado Springs, CO ===
        White  Black  Other
Male    91.21   6.87   1.93
Female  91.75   5.42   2.83

=== Columbia, SC ===
        White  Black  Other
Male    68.65  30.63   0.72
Female  67.74  31.46   0.81

=== Columbus, OH ===
        White  Black  Other
Male    89.03  10.18   0.79
Female  88.65  10.56   0.79

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    84.91  13.71   1.38
Female  83.98  14.69   1.34

=== Deltona-Daytona Beach-Ormond Beach, FL ===
        White  Black  Other
Male    88.66  10.77   0.58
Female  87.96  11.43   0.61

=== Denver-Aurora-Lakewood, CO ===
        White  Black  Other
Male    92.57   5.34   2.09
Female  92.57   5.32   2.11

=== Des Moines-West Des Moines, IA ===
        White  Black  Other
Male    95.75   3.24   1.01
Female  95.76   3.27   0.97

=== Detroit-Warren-Dearborn, MI ===
        White  Black  Other
Male    78.99  19.87   1.14
Female  77.78  21.08   1.14

=== El Paso, TX ===
        White  Black  Other
Male    94.01   4.78   1.21
Female  95.28   3.15   1.56

=== Fayetteville-Springdale-Rogers, AR-MO ===
        White  Black  Other
Male    97.72   0.87   1.42
Female  97.87   0.75   1.38

=== Fresno, CA ===
        White  Black  Other
Male    90.76   4.85   4.39
Female  90.60   5.05   4.36

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    94.40   4.68   0.92
Female  94.57   4.51   0.92

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    79.04  20.29   0.67
Female  78.17  21.22   0.60

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    83.02  16.62   0.37
Female  82.05  17.57   0.38

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    91.66   7.55   0.79
Female  91.50   7.71   0.79

=== Houston-The Woodlands-Sugar Land, TX ===
        White  Black  Other
Male    80.31  17.54   2.15
Female  78.98  18.98   2.04

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    87.18  12.23   0.59
Female  86.62  12.74   0.64

=== Jacksonville, FL ===
        White  Black  Other
Male    78.33  20.51   1.16
Female  76.59  22.24   1.17

=== Kansas City, MO-KS ===
        White  Black  Other
Male    86.98  11.97   1.05
Female  86.47  12.45   1.08

=== Knoxville, TN ===
        White  Black  Other
Male    93.99   5.44   0.57
Female  93.49   5.97   0.54

=== Lakeland-Winter Haven, FL ===
        White  Black  Other
Male    84.02  15.41   0.57
Female  84.77  14.69   0.54

=== Las Vegas-Henderson-Paradise, NV ===
        White  Black  Other
Male    87.54   9.84   2.62
Female  86.62  10.15   3.23

=== Little Rock-North Little Rock-Conway, AR ===
        White  Black  Other
Male    81.41  17.89   0.69
Female  80.15  19.02   0.83

=== Los Angeles-Long Beach-Anaheim, CA ===
        White  Black  Other
Male    83.18  10.09   6.72
Female  82.68  10.68   6.64

=== Louisville/Jefferson County, KY-IN ===
        White  Black  Other
Male    88.02  11.50   0.48
Female  87.21  12.24   0.55

=== Madison, WI ===
        White  Black  Other
Male    97.17   1.55   1.28
Female  97.61   1.26   1.13

=== McAllen-Edinburg-Mission, TX ===
        White  Black  Other
Male    99.52   0.21   0.26
Female  99.48   0.18   0.33

=== Memphis, TN-MS-AR ===
        White  Black  Other
Male    59.68  39.77   0.55
Female  57.74  41.71   0.55

=== Miami-Fort Lauderdale-West Palm Beach, FL ===
        White  Black  Other
Male    87.17  12.19   0.64
Female  87.39  11.99   0.63

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    88.32  10.55   1.14
Female  87.69  11.19   1.13

=== Minneapolis-St. Paul-Bloomington, MN-WI ===
        White  Black  Other
Male    95.72   2.38   1.90
Female  95.88   2.21   1.91

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    84.69  14.82   0.49
Female  83.66  15.86   0.48

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    65.09  33.42   1.49
Female  63.14  35.56   1.30

=== New York-Newark-Jersey City, NY-NJ-PA ===
        White  Black  Other
Male    80.67  16.70   2.63
Female  79.56  18.04   2.41

=== North Port-Sarasota-Bradenton, FL ===
        White  Black  Other
Male    92.69   6.80   0.51
Female  92.79   6.72   0.49

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    96.36   1.80   1.84
Female  96.81   1.24   1.96

=== Oklahoma City, OK ===
        White  Black  Other
Male    87.20   9.04   3.76
Female  86.87   9.41   3.72

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    92.40   6.61   0.98
Female  91.93   6.94   1.13

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    86.46  12.56   0.98
Female  85.72  13.24   1.04

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    93.34   2.33   4.32
Female  93.26   2.11   4.63

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    90.64   8.54   0.82
Female  90.12   8.86   1.02

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===
        White  Black  Other
Male    81.05  17.79   1.16
Female  79.91  18.97   1.12

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    93.50   3.39   3.11
Female  93.64   3.15   3.21

=== Pittsburgh, PA ===
        White  Black  Other
Male    92.94   6.55   0.51
Female  92.60   6.92   0.48

=== Portland-Vancouver-Hillsboro, OR-WA ===
        White  Black  Other
Male    94.56   2.58   2.86
Female  94.73   2.45   2.82

=== Providence-Warwick, RI-MA ===
        White  Black  Other
Male    96.27   2.80   0.92
Female  96.41   2.69   0.90

=== Provo-Orem, UT ===
        White  Black  Other
Male    97.95   0.09   1.96
Female  97.94   0.05   2.01

=== Raleigh, NC ===
        White  Black  Other
Male    77.01  22.09   0.90
Female  75.83  23.38   0.79

=== Richmond, VA ===
        White  Black  Other
Male    69.63  29.43   0.94
Female  68.84  30.18   0.98

=== Riverside-San Bernardino-Ontario, CA ===
        White  Black  Other
Male    91.54   5.42   3.05
Female  91.72   5.05   3.23

=== Rochester, NY ===
        White  Black  Other
Male    91.04   8.03   0.93
Female  90.87   8.24   0.89

=== Sacramento--Roseville--Arden-Arcade, CA ===
        White  Black  Other
Male    88.42   5.83   5.75
Female  88.50   5.64   5.87

=== Salt Lake City, UT ===
        White  Black  Other
Male    96.78   0.76   2.46
Female  96.97   0.59   2.44

=== San Antonio-New Braunfels, TX ===
        White  Black  Other
Male    92.79   6.27   0.94
Female  92.41   6.44   1.14

=== San Diego-Carlsbad, CA ===
        White  Black  Other
Male    88.05   6.13   5.82
Female  88.43   5.30   6.28

=== San Francisco-Oakland-Hayward, CA ===
        White  Black  Other
Male    76.98  11.99  11.03
Female  76.60  12.30  11.10

=== San Jose-Sunnyvale-Santa Clara, CA ===
        White  Black  Other
Male    87.38   3.52   9.10
Female  87.82   3.35   8.83

=== Seattle-Tacoma-Bellevue, WA ===
        White  Black  Other
Male    90.42   4.56   5.01
Female  90.78   3.94   5.28

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    95.87   1.37   2.76
Female  96.17   0.99   2.83

=== Springfield, MA ===
        White  Black  Other
Male    92.87   6.61   0.51
Female  92.67   6.78   0.55

=== St. Louis, MO-IL ===
        White  Black  Other
Male    83.47  15.84   0.69
Female  82.26  17.02   0.72

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    86.03   5.82   8.15
Female  87.14   5.59   7.27

=== Syracuse, NY ===
        White  Black  Other
Male    94.08   4.76   1.16
Female  93.89   4.96   1.15

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    90.27   9.09   0.64
Female  90.00   9.28   0.72

=== Toledo, OH ===
        White  Black  Other
Male    88.86  10.36   0.78
Female  88.44  10.84   0.72

=== Tucson, AZ ===
        White  Black  Other
Male    92.89   3.10   4.02
Female  93.11   2.75   4.14

=== Tulsa, OK ===
        White  Black  Other
Male    86.34   7.65   6.01
Female  85.86   8.14   6.00

=== Urban Honolulu, HI ===
        White  Black  Other
Male    38.41   3.06  58.53
Female  34.21   1.55  64.24

=== Virginia Beach-Norfolk-Newport News, VA-NC ===
        White  Black  Other
Male    70.80  27.33   1.87
Female  68.24  29.82   1.94

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===
        White  Black  Other
Male    71.61  25.54   2.85
Female  70.20  26.90   2.90

=== Wichita, KS ===
        White  Black  Other
Male    91.03   6.90   2.07
Female  90.83   7.21   1.96

=== Winston-Salem, NC ===
        White  Black  Other
Male    82.92  16.69   0.39
Female  81.65  17.94   0.40

=== Worcester, MA-CT ===
        White  Black  Other
Male    97.76   1.62   0.62
Female  98.01   1.35   0.64

In [465]:
merged_pop_1980 = merged_pop_1980.merge(
    total_pop[["metro13", "MSA Population"]],
    on="metro13",
    how="left",  # left join keeps all df_main rows
)
merged_pop_1980.head(10)

,Year of Estimate,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,35 to 39 years,...,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,fips,metro13,metro_title,MSA Population
0,1980.0,White male,410.0,535.0,549.0,550.0,468.0,462.0,416.0,440.0,...,221.0,204.0,126.0,71.0,35.0,5919.0,01007,13820,"Birmingham-Hoover, AL",930461.0
1,1980.0,White female,439.0,470.0,518.0,502.0,444.0,424.0,430.0,403.0,...,316.0,253.0,190.0,120.0,77.0,6147.0,01007,13820,"Birmingham-Hoover, AL",930461.0
2,1980.0,Black male,199.0,188.0,210.0,220.0,154.0,156.0,90.0,64.0,...,61.0,63.0,42.0,13.0,9.0,1717.0,01007,13820,"Birmingham-Hoover, AL",930461.0
3,1980.0,Black female,196.0,191.0,206.0,243.0,186.0,137.0,94.0,77.0,...,84.0,73.0,54.0,19.0,29.0,1948.0,01007,13820,"Birmingham-Hoover, AL",930461.0
4,1980.0,Other races male,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,4.0,01007,13820,"Birmingham-Hoover, AL",930461.0
5,1980.0,Other races female,0.0,0.0,0.0,3.0,3.0,0.0,0.0,1.0,...,1.0,1.0,0.0,0.0,0.0,10.0,01007,13820,"Birmingham-Hoover, AL",930461.0
6,1980.0,White male,1275.0,1473.0,1630.0,1716.0,1390.0,1320.0,1320.0,1199.0,...,733.0,566.0,333.0,160.0,89.0,17760.0,01009,13820,"Birmingham-Hoover, AL",930461.0
7,1980.0,White female,1228.0,1429.0,1470.0,1561.0,1299.0,1330.0,1362.0,1251.0,...,766.0,713.0,455.0,247.0,196.0,18102.0,01009,13820,"Birmingham-Hoover, AL",930461.0
8,1980.0,Black male,32.0,31.0,32.0,38.0,24.0,19.0,14.0,9.0,...,15.0,8.0,5.0,3.0,1.0,280.0,01009,13820,"Birmingham-Hoover, AL",930461.0
9,1980.0,Black female,26.0,31.0,30.0,39.0,29.0,26.0,17.0,12.0,...,14.0,6.0,9.0,4.0,6.0,317.0,01009,13820,"Birmingham-Hoover, AL",930461.0

In [466]:
merged_pop_1980.columns

Index(['Year of Estimate', 'Race/Sex Indicator', 'Under 5 years',
       '5 to 9 years', '10 to 14 years', '15 to 19 years', '20 to 24 years',
       '25 to 29 years', '30 to 34 years', '35 to 39 years', '40 to 44 years',
       '45 to 49 years', '50 to 54 years', '55 to 59 years', '60 to 64 years',
       '65 to 69 years', '70 to 74 years', '75 to 79 years', '80 to 84 years',
       '85 years and over', 'Total Population', 'fips', 'metro13',
       'metro_title', 'MSA Population'],
      dtype='object')

### make 1980 look like 2022 data structure

In [467]:
age_groups_with_total = ["Total Population"] + pop_1980_agg.columns[3:-4].to_list()

id_vars = [
    "Year of Estimate",
    "metro13",
    "metro_title",
]

# stack the age groups (+ Total Population) into a single column
long_df = pop_1980_agg.melt(
    id_vars=id_vars + ["Race/Sex Indicator"],
    value_vars=age_groups_with_total,
    var_name="AGEGRP",
    value_name="Population",
)

# normalize the race/sex label for gender detection
rsi_norm = long_df["Race/Sex Indicator"].astype(str).str.strip().str.lower()

# add an MSA Pop per age group as a new "race/sex" category
msa_totals = long_df.groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)[
    "Population"
].sum()
msa_totals["Race/Sex Indicator"] = "MSA Population"

# calculate gender totals
male_mask = rsi_norm.str.endswith(" male")
female_mask = rsi_norm.str.endswith(" female")

total_male = (
    long_df.loc[male_mask]
    .groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)["Population"]
    .sum()
)
total_male["Race/Sex Indicator"] = "Total male"
total_male["Race/Sex Indicator"]
total_female = (
    long_df.loc[female_mask]
    .groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)["Population"]
    .sum()
)
total_female["Race/Sex Indicator"] = "Total female"

# append the computed categories
long_augmented = pd.concat(
    [long_df, msa_totals, total_male, total_female], ignore_index=True
)

# each Race/Sex Indicator (incl. MSA Population) becomes a column
pop_1980_wide = long_augmented.pivot_table(
    index=id_vars + ["AGEGRP"],
    columns="Race/Sex Indicator",
    values="Population",
    aggfunc="sum",  # safe if duplicates exist
).reset_index()
pop_1980_wide.columns.name = None

# turn each age group into integer; 0 for "Total Population"
age_id_map = {name: i for i, name in enumerate(age_groups_with_total)}
pop_1980_wide["AGEGRP"] = pop_1980_wide["AGEGRP"].map(age_id_map).astype("Int64")

# Put key aggregates first if present
race_cols = [c for c in pop_1980_wide.columns if c not in id_vars + ["AGEGRP"]]
preferred = [
    c for c in ["MSA Population", "Total male", "Total female"] if c in race_cols
]
others = [c for c in race_cols if c not in preferred]
race_cols = preferred + others

final_pop_1980 = (
    pop_1980_wide.sort_values(id_vars + ["AGEGRP"]).reset_index(drop=True)
)[id_vars + ["AGEGRP"] + race_cols]

# final_df is your result
final_pop_1980.head(20)

,Year of Estimate,metro13,metro_title,AGEGRP,MSA Population,Total male,Total female,Black female,Black male,Other races female,Other races male,White female,White male
0,1980.0,10420,"Akron, OH",0,660527.0,319350.0,341177.0,32098.0,28286.0,2206.0,2053.0,306873.0,289011.0
1,1980.0,10420,"Akron, OH",2,45259.0,23291.0,21968.0,2811.0,2910.0,195.0,194.0,18962.0,20187.0
2,1980.0,10420,"Akron, OH",3,47257.0,24305.0,22952.0,2909.0,2960.0,213.0,204.0,19830.0,21141.0
3,1980.0,10420,"Akron, OH",4,53300.0,27183.0,26117.0,2917.0,3112.0,188.0,179.0,23012.0,23892.0
4,1980.0,10420,"Akron, OH",5,63374.0,31723.0,31651.0,3479.0,3297.0,185.0,174.0,27987.0,28252.0
5,1980.0,10420,"Akron, OH",6,65149.0,31864.0,33285.0,3382.0,2688.0,177.0,196.0,29726.0,28980.0
6,1980.0,10420,"Akron, OH",7,56505.0,27970.0,28535.0,2803.0,2213.0,285.0,218.0,25447.0,25539.0
7,1980.0,10420,"Akron, OH",8,51191.0,25093.0,26098.0,2393.0,1835.0,270.0,249.0,23435.0,23009.0
8,1980.0,10420,"Akron, OH",9,38826.0,18909.0,19917.0,1768.0,1438.0,202.0,171.0,17947.0,17300.0
9,1980.0,10420,"Akron, OH",10,33732.0,16133.0,17599.0,1552.0,1280.0,124.0,151.0,15923.0,14702.0
10,1980.0,10420,"Akron, OH",11,32844.0,15971.0,16873.0,1460.0,1213.0,104.0,100.0,15309.0,14658.0
11,1980.0,10420,"Akron, OH",12,37098.0,18102.0,18996.0,1537.0,1274.0,70.0,68.0,17389.0,16760.0
12,1980.0,10420,"Akron, OH",13,37078.0,17606.0,19472.0,1450.0,1235.0,53.0,56.0,17969.0,16315.0
13,1980.0,10420,"Akron, OH",14,29858.0,14028.0,15830.0,1086.0,974.0,37.0,35.0,14707.0,13019.0
14,1980.0,10420,"Akron, OH",15,23451.0,10246.0,13205.0,933.0,756.0,33.0,21.0,12239.0,9469.0
15,1980.0,10420,"Akron, OH",16,17889.0,7234.0,10655.0,680.0,512.0,22.0,16.0,9953.0,6706.0
16,1980.0,10580,"Albany-Schenectady-Troy, NY",0,772242.0,370725.0,401517.0,15598.0,14040.0,3133.0,3105.0,382786.0,353580.0
17,1980.0,10580,"Albany-Schenectady-Troy, NY",2,48298.0,24776.0,23522.0,1328.0,1363.0,309.0,271.0,21885.0,23142.0
18,1980.0,10580,"Albany-Schenectady-Troy, NY",3,51977.0,26743.0,25234.0,1364.0,1324.0,308.0,284.0,23562.0,25135.0
19,1980.0,10580,"Albany-Schenectady-Troy, NY",4,61878.0,31813.0,30065.0,1580.0,1580.0,245.0,265.0,28240.0,29968.0

In [468]:
# rename columns to match 2022
final_pop_1980 = final_pop_1980.rename(
    columns={
        "MSA Population": "TOT_POP",
        "Total male": "TOT_MALE",
        "Total female": "TOT_FEMALE",
        "Black female": "BAC_FEMALE",
        "Black male": "BAC_MALE",
        "Other races female": "OTHER_FEMALE",
        "Other races male": "OTHER_MALE",
        "White female": "WAC_FEMALE",
        "White male": "WAC_MALE",
        "Year of Estimate": "year",
    }
)
final_pop_1980

,year,metro13,metro_title,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,BAC_FEMALE,BAC_MALE,OTHER_FEMALE,OTHER_MALE,WAC_FEMALE,WAC_MALE
0,1980.0,10420,"Akron, OH",0,660527.0,319350.0,341177.0,32098.0,28286.0,2206.0,2053.0,306873.0,289011.0
1,1980.0,10420,"Akron, OH",2,45259.0,23291.0,21968.0,2811.0,2910.0,195.0,194.0,18962.0,20187.0
2,1980.0,10420,"Akron, OH",3,47257.0,24305.0,22952.0,2909.0,2960.0,213.0,204.0,19830.0,21141.0
3,1980.0,10420,"Akron, OH",4,53300.0,27183.0,26117.0,2917.0,3112.0,188.0,179.0,23012.0,23892.0
4,1980.0,10420,"Akron, OH",5,63374.0,31723.0,31651.0,3479.0,3297.0,185.0,174.0,27987.0,28252.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1467,1980.0,49340,"Worcester, MA-CT",12,33755.0,16193.0,17562.0,135.0,145.0,85.0,51.0,17342.0,15997.0
1468,1980.0,49340,"Worcester, MA-CT",13,35374.0,16490.0,18884.0,100.0,119.0,49.0,44.0,18735.0,16327.0
1469,1980.0,49340,"Worcester, MA-CT",14,32811.0,14948.0,17863.0,83.0,83.0,40.0,21.0,17740.0,14844.0
1470,1980.0,49340,"Worcester, MA-CT",15,27683.0,12263.0,15420.0,77.0,70.0,31.0,24.0,15312.0,12169.0
1471,1980.0,49340,"Worcester, MA-CT",16,21269.0,8590.0,12679.0,58.0,36.0,19.0,15.0,12602.0,8539.0

In [469]:
msa_tables_1980 = {}

agg_cols = [
    "TOT_POP",
    "TOT_MALE",
    "TOT_FEMALE",
    "WAC_MALE",
    "BAC_MALE",
    "OTHER_MALE",
    "WAC_FEMALE",
    "BAC_FEMALE",
    "OTHER_FEMALE",
]
msa_totals = final_pop_1980.groupby("metro_title", as_index=False)[agg_cols].sum()

# male race shares within each MSA
male_props = msa_totals[
    ["metro_title", "WAC_MALE", "BAC_MALE", "OTHER_MALE", "TOT_MALE"]
].copy()
male_props[["White", "Black", "Other"]] = male_props[
    ["WAC_MALE", "BAC_MALE", "OTHER_MALE"]
].div(male_props["TOT_MALE"], axis=0)
male_props = male_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)

# female race shares within each MSA
female_props = msa_totals[
    ["metro_title", "WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE", "TOT_FEMALE"]
].copy()
female_props[["White", "Black", "Other"]] = female_props[
    ["WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE"]
].div(female_props["TOT_FEMALE"], axis=0)
female_props = female_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)


for msa in msa_totals["metro_title"]:
    male_row = male_props.loc[
        male_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()
    female_row = female_props.loc[
        female_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()

    proportions = pd.DataFrame(
        [male_row.to_numpy(), female_row.to_numpy()],
        index=["Male", "Female"],
        columns=["White", "Black", "Other"],
    ).astype(float)
    proportions = (proportions * 100).round(2)
    msa_tables_1980[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    90.45   8.90   0.65
Female  89.82   9.52   0.66

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    95.33   3.83   0.85
Female  95.24   3.96   0.80

=== Albuquerque, NM ===
        White  Black  Other
Male    92.55   2.31   5.14
Female  92.41   2.06   5.54

=== Allentown-Bethlehem-Easton, PA-NJ ===
        White  Black  Other
Male    97.80   1.57   0.64
Female  97.97   1.44   0.60

=== Atlanta-Sandy Springs-Roswell, GA ===
        White  Black  Other
Male    75.96  23.30   0.75
Female  74.15  25.13   0.73

=== Augusta-Richmond County, GA-SC ===
        White  Black  Other
Male    66.72  32.45   0.82
Female  65.08  33.80   1.12

=== Austin-Round Rock, TX ===
        White  Black  Other
Male    88.85   9.74   1.41
Female  88.37  10.33   1.30

=== Bakersfield, CA ===
        White  Black  Other
Male    90.54   5.52   3.94
Female  90.83   5.30   3.87

=== Baltimore-Columbia-Towson, MD ===
        White  Black  Other
Male    73.81  24.93   1.25
Female  72.35  26.38   1.27

=== Baton Rouge, LA ===
        White  Black  Other
Male    68.96  30.38   0.66
Female  67.46  31.95   0.59

=== Birmingham-Hoover, AL ===
        White  Black  Other
Male    74.07  25.60   0.33
Female  72.21  27.44   0.35

=== Boise City, ID ===
        White  Black  Other
Male    97.99   0.40   1.62
Female  98.16   0.24   1.59

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    93.82   4.82   1.36
Female  93.81   4.93   1.26

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    89.76   9.06   1.17
Female  89.31   9.61   1.08

=== Cape Coral-Fort Myers, FL ===
        White  Black  Other
Male    91.36   8.23   0.41
Female  91.36   8.17   0.47

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    69.58  29.22   1.19
Female  65.93  32.83   1.24

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    78.83  20.42   0.75
Female  77.61  21.71   0.68

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    78.83  18.99   2.18
Female  77.19  20.67   2.14

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    89.20  10.25   0.55
Female  88.38  11.07   0.54

=== Colorado Springs, CO ===
        White  Black  Other
Male    91.15   6.91   1.94
Female  91.65   5.49   2.87

=== Columbia, SC ===
        White  Black  Other
Male    68.63  30.65   0.73
Female  67.59  31.59   0.82

=== Columbus, OH ===
        White  Black  Other
Male    88.99  10.20    0.8
Female  88.54  10.66    0.8

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    84.88  13.73   1.39
Female  83.84  14.80   1.36

=== Deltona-Daytona Beach-Ormond Beach, FL ===
        White  Black  Other
Male    88.40  11.01   0.59
Female  87.63  11.75   0.62

=== Denver-Aurora-Lakewood, CO ===
        White  Black  Other
Male    92.54   5.36   2.10
Female  92.50   5.37   2.13

=== Des Moines-West Des Moines, IA ===
        White  Black  Other
Male    95.73   3.25   1.02
Female  95.70   3.31   0.99

=== Detroit-Warren-Dearborn, MI ===
        White  Black  Other
Male    78.92  19.93   1.15
Female  77.58  21.26   1.16

=== El Paso, TX ===
        White  Black  Other
Male    93.98   4.81   1.21
Female  95.24   3.18   1.58

=== Fayetteville-Springdale-Rogers, AR-MO ===
        White  Black  Other
Male    97.69   0.88   1.43
Female  97.83   0.76   1.40

=== Fresno, CA ===
        White  Black  Other
Male    90.76   4.86   4.38
Female  90.55   5.08   4.37

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    94.35   4.73   0.93
Female  94.47   4.59   0.94

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    78.97  20.35   0.68
Female  77.97  21.42   0.61

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    82.99  16.64   0.37
Female  81.95  17.66   0.39

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    91.61   7.58   0.80
Female  91.38   7.81   0.81

=== Houston-The Woodlands-Sugar Land, TX ===
        White  Black  Other
Male    80.33  17.51   2.16
Female  78.93  19.01   2.06

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    87.16  12.25   0.59
Female  86.51  12.84   0.65

=== Jacksonville, FL ===
        White  Black  Other
Male    78.32  20.51   1.16
Female  76.48  22.33   1.19

=== Kansas City, MO-KS ===
        White  Black  Other
Male    86.94  11.99   1.06
Female  86.32  12.58   1.10

=== Knoxville, TN ===
        White  Black  Other
Male    93.99   5.44   0.58
Female  93.47   5.98   0.55

=== Lakeland-Winter Haven, FL ===
        White  Black  Other
Male    83.85  15.57   0.57
Female  84.52  14.92   0.55

=== Las Vegas-Henderson-Paradise, NV ===
        White  Black  Other
Male    87.48   9.89   2.63
Female  86.51  10.23   3.25

=== Little Rock-North Little Rock-Conway, AR ===
        White  Black  Other
Male    81.42  17.88   0.70
Female  80.04  19.12   0.84

=== Los Angeles-Long Beach-Anaheim, CA ===
        White  Black  Other
Male    83.10  10.15   6.76
Female  82.45  10.80   6.74

=== Louisville/Jefferson County, KY-IN ===
        White  Black  Other
Male    88.00  11.52   0.48
Female  87.12  12.32   0.56

=== Madison, WI ===
        White  Black  Other
Male    97.14   1.57   1.29
Female  97.56   1.29   1.15

=== McAllen-Edinburg-Mission, TX ===
        White  Black  Other
Male    99.52   0.21   0.26
Female  99.49   0.18   0.33

=== Memphis, TN-MS-AR ===
        White  Black  Other
Male    59.75  39.69   0.56
Female  57.60  41.85   0.55

=== Miami-Fort Lauderdale-West Palm Beach, FL ===
        White  Black  Other
Male    86.79  12.55   0.66
Female  86.97  12.39   0.64

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    88.19  10.66   1.15
Female  87.41  11.44   1.15

=== Minneapolis-St. Paul-Bloomington, MN-WI ===
        White  Black  Other
Male    95.68   2.39   1.92
Female  95.80   2.25   1.95

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    84.70  14.81   0.50
Female  83.58  15.94   0.49

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    65.03  33.47   1.49
Female  62.86  35.82   1.32

=== New York-Newark-Jersey City, NY-NJ-PA ===
        White  Black  Other
Male    80.49  16.86   2.66
Female  79.20  18.35   2.46

=== North Port-Sarasota-Bradenton, FL ===
        White  Black  Other
Male    92.39   7.09   0.53
Female  92.47   7.01   0.51

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    96.34   1.81   1.85
Female  96.79   1.24   1.97

=== Oklahoma City, OK ===
        White  Black  Other
Male    87.15   9.05   3.80
Female  86.73   9.49   3.78

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    92.35   6.65   0.99
Female  91.81   7.04   1.16

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    86.35  12.66   0.99
Female  85.50  13.43   1.06

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    93.30   2.35   4.34
Female  93.17   2.13   4.69

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    90.57   8.61   0.83
Female  90.00   8.96   1.04

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===
        White  Black  Other
Male    80.97  17.86   1.17
Female  79.68  19.18   1.14

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    93.45   3.41   3.14
Female  93.55   3.19   3.26

=== Pittsburgh, PA ===
        White  Black  Other
Male    92.94   6.55   0.51
Female  92.53   6.98   0.49

=== Portland-Vancouver-Hillsboro, OR-WA ===
        White  Black  Other
Male    94.52   2.60   2.88
Female  94.63   2.49   2.87

=== Providence-Warwick, RI-MA ===
        White  Black  Other
Male    96.24   2.83   0.93
Female  96.34   2.75   0.91

=== Provo-Orem, UT ===
        White  Black  Other
Male    97.93   0.09   1.97
Female  97.92   0.05   2.03

=== Raleigh, NC ===
        White  Black  Other
Male    77.04  22.05    0.9
Female  75.78  23.42    0.8

=== Richmond, VA ===
        White  Black  Other
Male    69.59  29.46   0.95
Female  68.61  30.40   1.00

=== Riverside-San Bernardino-Ontario, CA ===
        White  Black  Other
Male    91.45   5.47   3.08
Female  91.58   5.13   3.30

=== Rochester, NY ===
        White  Black  Other
Male    90.93   8.13   0.94
Female  90.65   8.44   0.91

=== Sacramento--Roseville--Arden-Arcade, CA ===
        White  Black  Other
Male    88.37   5.88   5.76
Female  88.37   5.71   5.92

=== Salt Lake City, UT ===
        White  Black  Other
Male    96.76   0.76   2.47
Female  96.94   0.60   2.46

=== San Antonio-New Braunfels, TX ===
        White  Black  Other
Male    92.78   6.27   0.95
Female  92.38   6.46   1.16

=== San Diego-Carlsbad, CA ===
        White  Black  Other
Male    87.94   6.19   5.87
Female  88.21   5.39   6.40

=== San Francisco-Oakland-Hayward, CA ===
        White  Black  Other
Male    76.86  12.07  11.07
Female  76.24  12.49  11.27

=== San Jose-Sunnyvale-Santa Clara, CA ===
        White  Black  Other
Male    87.33   3.55   9.12
Female  87.66   3.40   8.94

=== Seattle-Tacoma-Bellevue, WA ===
        White  Black  Other
Male    90.36   4.60   5.04
Female  90.63   4.01   5.36

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    95.83   1.38   2.79
Female  96.11   1.01   2.88

=== Springfield, MA ===
        White  Black  Other
Male    92.78   6.70   0.52
Female  92.49   6.95   0.56

=== St. Louis, MO-IL ===
        White  Black  Other
Male    83.41  15.89   0.70
Female  82.04  17.23   0.74

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    86.07   5.85   8.08
Female  86.99   5.64   7.36

=== Syracuse, NY ===
        White  Black  Other
Male    94.02   4.82   1.17
Female  93.76   5.07   1.17

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    90.01   9.34   0.66
Female  89.65   9.61   0.74

=== Toledo, OH ===
        White  Black  Other
Male    88.81  10.40   0.79
Female  88.27  10.99   0.74

=== Tucson, AZ ===
        White  Black  Other
Male    92.83   3.11   4.05
Female  93.02   2.76   4.21

=== Tulsa, OK ===
        White  Black  Other
Male    86.33   7.63   6.05
Female  85.77   8.18   6.06

=== Urban Honolulu, HI ===
        White  Black  Other
Male    38.55   3.10  58.35
Female  34.24   1.57  64.19

=== Virginia Beach-Norfolk-Newport News, VA-NC ===
        White  Black  Other
Male    70.81  27.31   1.88
Female  68.11  29.92   1.97

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===
        White  Black  Other
Male    71.57  25.58   2.86
Female  70.01  27.05   2.94

=== Wichita, KS ===
        White  Black  Other
Male    90.97   6.94   2.09
Female  90.67   7.33   2.00

=== Winston-Salem, NC ===
        White  Black  Other
Male    82.91  16.70   0.39
Female  81.56  18.03   0.41

=== Worcester, MA-CT ===
        White  Black  Other
Male    97.73   1.64   0.63
Female  97.97   1.38   0.65

## 2022

### data wrangling

codebook: https://www2.census.gov/programs-surveys/popest/technical-documentation/file-layouts/2020-2023/CBSA-EST2023-ALLDATA-CHAR.pdf

In [470]:
pop2 = pd.read_csv(DATA_DIR / "pop_2022.csv", encoding="latin1").drop(
    columns=["MDIV", "LSAD", "SUMLEV"]
)
pop2 = pop2.query(
    "`YEAR` == 4"
)  # 1 = 4/1/2020 population estimates, 2 = 7/1/2020, 3 = 7/1/2021, 4 = 7/1/2022, 5 = 7/1/2023
pop2 = pop2.drop(columns=["YEAR"])
pop2["CBSA"] = pop2["CBSA"].astype(int).astype(str)
pop2

,CBSA,NAME,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,...,HWAC_MALE,HWAC_FEMALE,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE
57,10180,"Abilene, TX",0,179665,91450,88215,76766,76213,9412,6473,...,20990,19398,1229,1104,852,769,341,234,132,105
58,10180,"Abilene, TX",1,11307,5862,5445,4713,4344,668,631,...,1724,1524,151,163,53,40,20,20,9,13
59,10180,"Abilene, TX",2,11934,5980,5954,4944,4920,524,527,...,1667,1790,146,143,60,71,34,29,9,3
60,10180,"Abilene, TX",3,11716,5951,5765,4930,4750,568,526,...,1797,1717,118,134,63,69,31,32,11,14
61,10180,"Abilene, TX",4,13387,6902,6485,5775,5459,653,591,...,1946,1817,120,137,57,73,26,35,13,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
91366,49820,"Zapata, TX",14,525,261,264,251,261,4,0,...,227,235,2,0,2,0,0,0,0,0
91367,49820,"Zapata, TX",15,506,226,280,221,271,2,1,...,178,234,1,0,2,2,0,0,0,0
91368,49820,"Zapata, TX",16,366,171,195,169,190,1,0,...,137,172,0,0,0,1,0,0,0,0
91369,49820,"Zapata, TX",17,279,146,133,143,131,1,0,...,125,105,0,0,2,0,0,1,0,0
91370,49820,"Zapata, TX",18,171,83,88,80,84,1,1,...,47,54,0,0,0,0,0,0,0,0

In [471]:
# keep only rows relevant to bfi dataset
merged_pop_2022 = pop2.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="CBSA",
    right_on="metro13",
    how="inner",
).drop(columns=["CBSA", "NAME"])
merged_pop_2022

,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,IA_MALE,IA_FEMALE,...,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE,metro13,metro_title
0,0,697511,340470,357041,274240,283462,42224,48769,689,791,...,1243,1385,351,428,214,209,106,96,10420,"Akron, OH"
1,1,35331,17932,17399,12431,11813,3124,3249,24,39,...,150,170,34,51,30,27,8,10,10420,"Akron, OH"
2,2,38893,19771,19122,13812,13103,3488,3493,38,41,...,175,197,36,43,42,19,20,15,10420,"Akron, OH"
3,3,40363,20575,19788,14756,14131,3553,3440,33,28,...,165,139,33,24,17,24,18,12,10420,"Akron, OH"
4,4,43776,21969,21807,16630,16243,3318,3447,37,52,...,116,147,34,47,14,25,11,12,10420,"Akron, OH"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2503,14,50333,24611,25722,22730,23687,900,909,93,104,...,176,193,73,69,14,14,6,6,49340,"Worcester, MA-CT"
2504,15,38465,18272,20193,17106,18766,519,591,51,39,...,81,125,36,15,3,5,1,7,49340,"Worcester, MA-CT"
2505,16,26576,12204,14372,11535,13457,272,356,38,28,...,58,85,16,18,6,5,2,2,49340,"Worcester, MA-CT"
2506,17,15848,6558,9290,6195,8668,95,217,18,26,...,33,35,8,18,3,4,2,1,49340,"Worcester, MA-CT"
2507,18,15892,5380,10512,5051,10060,95,143,22,42,...,16,40,4,22,0,6,1,3,49340,"Worcester, MA-CT"

In [472]:
# organize to look lik 1980 data
min_df_2022 = merged_pop_2022.query("`AGEGRP` == 0")
min_df_2022 = min_df_2022[
    [
        "metro13",
        "metro_title",
        "TOT_POP",
        "TOT_MALE",
        "TOT_FEMALE",
        "WAC_MALE",
        "WAC_FEMALE",
        "BAC_MALE",
        "BAC_FEMALE",
    ]
]
min_df_2022["OTHER_MALE"] = merged_pop_2022[
    ["IAC_MALE", "AAC_MALE", "NAC_MALE", "H_MALE"]
].sum(axis=1)
min_df_2022["OTHER_FEMALE"] = merged_pop_2022[
    ["IAC_FEMALE", "AAC_FEMALE", "NAC_FEMALE", "H_FEMALE"]
].sum(axis=1)
min_df_2022

,metro13,metro_title,TOT_POP,TOT_MALE,TOT_FEMALE,WAC_MALE,WAC_FEMALE,BAC_MALE,BAC_FEMALE,OTHER_MALE,OTHER_FEMALE
0,10420,"Akron, OH",697511,340470,357041,283032,292666,48263,55181,28317,28991
19,10580,"Albany-Schenectady-Troy, NY",903595,444908,458687,376888,387186,49961,52717,60323,61017
38,10740,"Albuquerque, NM",920138,453849,466289,387217,396806,22776,20263,280626,292251
57,10900,"Allentown-Bethlehem-Easton, PA-NJ",870570,430821,439749,372434,381962,45722,45779,111054,110572
76,12060,"Atlanta-Sandy Springs-Roswell, GA",6238676,3026811,3211865,1742669,1753778,1089376,1260024,672513,664940
...,...,...,...,...,...,...,...,...,...,...,...
2413,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1340607,655375,685232,437406,445414,132463,145369,240697,248433
2432,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1788040,858316,929724,346238,336201,476844,553959,223829,218129
2451,48620,"Wichita, KS",649687,323930,325757,280340,281438,32740,32296,73607,72626
2470,49180,"Winston-Salem, NC",688799,333034,355765,260295,271780,66148,76734,56856,57616
2489,49340,"Worcester, MA-CT",862873,428468,434405,371370,377521,36689,35478,90741,91948

In [473]:
msa_tables_2022 = {}

agg_cols = [
    "TOT_POP",
    "TOT_MALE",
    "TOT_FEMALE",
    "WAC_MALE",
    "BAC_MALE",
    "OTHER_MALE",
    "WAC_FEMALE",
    "BAC_FEMALE",
    "OTHER_FEMALE",
]
msa_totals = min_df_2022.groupby("metro_title", as_index=False)[agg_cols].sum()

# male race shares within each MSA
male_props = msa_totals[
    ["metro_title", "WAC_MALE", "BAC_MALE", "OTHER_MALE", "TOT_MALE"]
].copy()
male_props[["White", "Black", "Other"]] = male_props[
    ["WAC_MALE", "BAC_MALE", "OTHER_MALE"]
].div(male_props["TOT_MALE"], axis=0)
male_props = male_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)

# female race shares within each MSA
female_props = msa_totals[
    ["metro_title", "WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE", "TOT_FEMALE"]
].copy()
female_props[["White", "Black", "Other"]] = female_props[
    ["WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE"]
].div(female_props["TOT_FEMALE"], axis=0)
female_props = female_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)


for msa in msa_totals["metro_title"]:
    male_row = male_props.loc[
        male_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()
    female_row = female_props.loc[
        female_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()

    proportions = pd.DataFrame(
        [male_row.to_numpy(), female_row.to_numpy()],
        index=["Male", "Female"],
        columns=["White", "Black", "Other"],
    ).astype(float)
    proportions = (proportions * 100).round(2)
    msa_tables_2022[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    83.13  14.18   8.32
Female  81.97  15.46   8.12

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    84.71  11.23  13.56
Female  84.41  11.49  13.30

=== Albuquerque, NM ===
        White  Black  Other
Male    85.32   5.02  61.83
Female  85.10   4.35  62.68

=== Allentown-Bethlehem-Easton, PA-NJ ===
        White  Black  Other
Male    86.45  10.61  25.78
Female  86.86  10.41  25.14

=== Atlanta-Sandy Springs-Roswell, GA ===
        White  Black  Other
Male    57.57  35.99  22.22
Female  54.60  39.23  20.70

=== Augusta-Richmond County, GA-SC ===
        White  Black  Other
Male    61.19  37.35  11.63
Female  58.56  39.73  10.80

=== Austin-Round Rock, TX ===
        White  Black  Other
Male    82.29   9.49  43.61
Female  82.36   9.50  43.13

=== Bakersfield, CA ===
        White  Black  Other
Male    84.61   7.56  68.26
Female  84.63   7.24  67.97

=== Baltimore-Columbia-Towson, MD ===
        White  Black  Other
Male    63.70  30.75  17.47
Female  60.83  33.67  16.46

=== Baton Rouge, LA ===
        White  Black  Other
Male    61.88  36.04  10.72
Female  59.94  38.14   9.66

=== Birmingham-Hoover, AL ===
        White  Black  Other
Male    69.55  28.99   9.47
Female  67.31  31.18   8.52

=== Boise City, ID ===
        White  Black  Other
Male    94.85   2.18  21.64
Female  94.82   1.82  21.36

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    80.17  11.39  23.98
Female  79.78  11.49  23.69

=== Bridgeport-Stamford-Norwalk, CT ===
        White  Black  Other
Male    80.43  14.15  30.99
Female  79.16  15.24  30.17

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    82.55  13.63  12.39
Female  81.39  14.85  12.27

=== Cape Coral-Fort Myers, FL ===
        White  Black  Other
Male    88.22  10.34  28.31
Female  87.96  10.34  27.10

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    73.18  24.98  12.71
Female  71.03  27.01  11.82

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    71.13  24.42  19.91
Female  69.17  26.70  18.72

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    75.46  17.02  34.83
Female  73.09  19.21  33.29

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    83.61  14.10   9.56
Female  82.89  14.94   9.11

=== Colorado Springs, CO ===
        White  Black  Other
Male    87.80   9.54  26.90
Female  87.73   8.64  27.98

=== Columbia, SC ===
        White  Black  Other
Male    62.82  35.06  12.21
Female  60.19  37.89  10.96

=== Columbus, OH ===
        White  Black  Other
Male    77.05  19.01  13.09
Female  76.56  19.45  12.67

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    73.51  17.89  41.64
Female  71.89  19.62  40.03

=== Deltona-Daytona Beach-Ormond Beach, FL ===
        White  Black  Other
Male    85.60  12.94  19.87
Female  85.15  13.23  19.37

=== Denver-Aurora-Lakewood, CO ===
        White  Black  Other
Male    86.73   8.02  33.03
Female  86.51   7.64  33.46

=== Des Moines-West Des Moines, IA ===
        White  Black  Other
Male    88.42   7.86  15.23
Female  89.18   7.05  14.51

=== Detroit-Warren-Dearborn, MI ===
        White  Black  Other
Male    73.02  22.46  12.86
Female  70.54  25.21  12.22

=== El Paso, TX ===
        White  Black  Other
Male    91.96   5.84  85.03
Female  93.27   4.47  88.54

=== Fayetteville-Springdale-Rogers, AR-MO ===
        White  Black  Other
Male    88.88   4.18  28.60
Female  90.10   3.74  27.15

=== Fresno, CA ===
        White  Black  Other
Male    79.53   6.69  73.30
Female  79.46   6.86  72.13

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    88.58   9.47  15.23
Female  89.32   8.48  15.01

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    66.58  29.33  17.89
Female  64.60  31.64  16.56

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    81.12  17.29  13.24
Female  79.96  18.47  12.21

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    81.33  13.96  16.11
Female  81.95  13.59  15.58

=== Hartford-West Hartford-East Hartford, CT ===
        White  Black  Other
Male    79.72  14.85  24.58
Female  79.65  15.40  24.18

=== Houston-The Woodlands-Sugar Land, TX ===
        White  Black  Other
Male    72.14  18.96  50.20
Female  70.01  20.87  48.59

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    79.05  17.63  15.39
Female  78.17  18.77  14.42

=== Jacksonville, FL ===
        White  Black  Other
Male    73.29  23.15  18.13
Female  71.56  24.58  17.73

=== Kansas City, MO-KS ===
        White  Black  Other
Male    83.23  14.11  17.34
Female  82.65  14.69  16.57

=== Knoxville, TN ===
        White  Black  Other
Male    91.65   7.07   9.28
Female  91.68   7.03   8.75

=== Lakeland-Winter Haven, FL ===
        White  Black  Other
Male    80.04  18.60  34.21
Female  79.65  18.87  32.74

=== Las Vegas-Henderson-Paradise, NV ===
        White  Black  Other
Male    73.10  15.78  49.44
Female  70.38  16.46  50.94

=== Little Rock-North Little Rock-Conway, AR ===
        White  Black  Other
Male    73.87  24.64  11.76
Female  71.38  26.96  10.63

=== Los Angeles-Long Beach-Anaheim, CA ===
        White  Black  Other
Male    73.67   8.19  67.37
Female  71.77   8.60  68.00

=== Louisville/Jefferson County, KY-IN ===
        White  Black  Other
Male    82.33  16.42  11.17
Female  81.47  17.31  10.32

=== Madison, WI ===
        White  Black  Other
Male    88.62   6.66  15.06
Female  88.79   6.48  14.38

=== McAllen-Edinburg-Mission, TX ===
        White  Black  Other
Male    96.95   1.39  93.79
Female  97.29   1.07  94.53

=== Memphis, TN-MS-AR ===
        White  Black  Other
Male    50.52  47.37  12.09
Female  47.15  50.85  10.65

=== Miami-Fort Lauderdale-West Palm Beach, FL ===
        White  Black  Other
Male    74.68  22.88  50.69
Female  73.55  23.91  50.86

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    78.57  17.45  19.24
Female  76.88  19.21  18.42

=== Minneapolis-St. Paul-Bloomington, MN-WI ===
        White  Black  Other
Male    81.36  11.88  17.24
Female  81.35  11.63  16.99

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    81.34  15.99  15.80
Female  80.22  17.13  14.79

=== New Haven-Milford, CT ===
        White  Black  Other
Male    78.39  17.57  26.95
Female  77.45  18.48  26.32

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    56.54  39.95  19.35
Female  53.22  43.47  17.50

=== New York-Newark-Jersey City, NY-NJ-PA ===
        White  Black  Other
Male    66.76  20.54  41.61
Female  65.02  22.18  41.01

=== North Port-Sarasota-Bradenton, FL ===
        White  Black  Other
Male    90.31   7.87  18.49
Female  90.09   7.82  17.63

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    94.50   2.69  20.93
Female  94.47   2.23  20.93

=== Oklahoma City, OK ===
        White  Black  Other
Male    80.04  12.97  29.49
Female  79.38  13.25  28.82

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    87.07   9.67  18.98
Female  86.87   9.79  18.30

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    75.79  20.02  40.42
Female  74.81  20.69  40.28

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    87.13   3.58  58.24
Female  86.62   3.16  58.26

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    85.69  12.53  17.31
Female  84.83  12.82  17.66

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===
        White  Black  Other
Male    70.87  23.04   20.1
Female  69.03  24.90   19.4

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    84.66   8.40  41.98
Female  84.58   8.18  41.51

=== Pittsburgh, PA ===
        White  Black  Other
Male    88.47   9.85   6.58
Female  88.18  10.29   6.20

=== Portland-Vancouver-Hillsboro, OR-WA ===
        White  Black  Other
Male    86.46   5.24  27.93
Female  86.15   4.73  27.74

=== Providence-Warwick, RI-MA ===
        White  Black  Other
Male    86.35  10.66  21.59
Female  86.69  10.22  20.71

=== Provo-Orem, UT ===
        White  Black  Other
Male    94.97   1.72  21.02
Female  94.98   1.57  20.81

=== Raleigh, NC ===
        White  Black  Other
Male    71.66  21.21  22.81
Female  70.08  23.18  21.78

=== Richmond, VA ===
        White  Black  Other
Male    65.79  30.19  16.02
Female  63.49  32.61  14.82

=== Riverside-San Bernardino-Ontario, CA ===
        White  Black  Other
Male    80.62   9.84  67.17
Female  79.66  10.04  67.36

=== Rochester, NY ===
        White  Black  Other
Male    83.99  13.90  13.77
Female  83.04  14.79  13.46

=== Sacramento--Roseville--Arden-Arcade, CA ===
        White  Black  Other
Male    73.58   10.3  46.52
Female  72.78   10.2  46.51

=== Salt Lake City, UT ===
        White  Black  Other
Male    89.65   3.44  30.44
Female  89.75   2.96  30.39

=== San Antonio-New Braunfels, TX ===
        White  Black  Other
Male    86.79   9.63  60.76
Female  86.86   9.23  61.76

=== San Diego-Carlsbad, CA ===
        White  Black  Other
Male    79.16   7.47  53.00
Female  78.32   6.68  55.53

=== San Francisco-Oakland-Hayward, CA ===
        White  Black  Other
Male    61.62   9.29  58.61
Female  59.15   9.43  60.13

=== San Jose-Sunnyvale-Santa Clara, CA ===
        White  Black  Other
Male    55.53   3.94  71.50
Female  54.50   3.66  73.02

=== Seattle-Tacoma-Bellevue, WA ===
        White  Black  Other
Male    73.57   9.42  35.86
Female  72.90   8.68  36.64

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    92.25   4.08  15.72
Female  92.59   3.36  15.71

=== Springfield, MA ===
        White  Black  Other
Male    84.56  13.75  32.02
Female  84.35  13.65  32.48

=== St. Louis, MO-IL ===
        White  Black  Other
Male    79.30  18.49   8.94
Female  77.06  20.65   8.47

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    68.59   9.94  71.08
Female  67.91  10.17  70.16

=== Syracuse, NY ===
        White  Black  Other
Male    86.71  11.05  10.68
Female  86.17  11.37  10.60

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    81.85  14.97  28.24
Female  81.11  15.46  27.51

=== Toledo, OH ===
        White  Black  Other
Male    82.74  17.14  11.52
Female  81.68  18.15  11.21

=== Tucson, AZ ===
        White  Black  Other
Male    86.89   6.22  46.72
Female  87.27   5.33  47.56

=== Tulsa, OK ===
        White  Black  Other
Male    78.81  10.28  31.34
Female  78.34  10.67  30.44

=== Urban Honolulu, HI ===
        White  Black   Other
Male    40.90   4.85   96.81
Female  35.97   3.46  101.75

=== Virginia Beach-Norfolk-Newport News, VA-NC ===
        White  Black  Other
Male    64.39  32.57  16.02
Female  61.29  35.17  15.76

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===
        White  Black  Other
Male     61.8  27.59  33.46
Female   59.1  29.65  32.63

=== Wichita, KS ===
        White  Black  Other
Male    86.54  10.11  22.72
Female  86.40   9.91  22.29

=== Winston-Salem, NC ===
        White  Black  Other
Male    78.16  19.86  17.07
Female  76.39  21.57  16.19

=== Worcester, MA-CT ===
        White  Black  Other
Male    86.67   8.56  21.18
Female  86.91   8.17  21.17

# Employment

In [474]:
ind_1980 = pd.read_csv(DATA_DIR / "labor_1980.csv").drop(
    columns=["own_code", "industry_code", "qtr", "disclosure_code"]
)
ind_1980

,area_fips,agglvl_code,size_code,year,area_title,own_title,industry_title,agglvl_title,size_title,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,taxable_annual_wages,annual_contributions,annual_avg_wkly_wage,avg_annual_pay
0,US000,1,0,1980,U.S. TOTAL,Total Covered,All Industries,"National, Total Covered",All establishment sizes,4727300,89183700,1282196041100,454357237100,10737989200,276,14377
1,01000,18,0,1980,Alabama -- Statewide,Total Covered,All Industries,"State, Total Covered",All establishment sizes,68280,1319928,17033276439,6610136205,140947633,248,12904
2,01001,26,0,1980,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,459,7986,111409756,0,0,268,13950
3,01003,26,0,1980,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,1716,17387,174395507,0,0,192,10030
4,01005,26,0,1980,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,498,6549,67191094,0,0,197,10259
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17131,M9243,13,0,1980,"Worcester-Fitchburg-Leominster, Ma NECMA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,10858,223693,2877532661,0,0,247,12863
17132,M9260,13,0,1980,"Yakima, Wa MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,4130,52145,595190062,0,0,219,11414
17133,M9280,13,0,1980,"York, Pa MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,6557,137615,1820909824,0,0,254,13231
17134,M9320,13,0,1980,"Youngstown-Warren, Oh MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,9322,172050,2770426550,0,0,309,16102
17135,M9340,13,0,1980,"Yuba City, Ca MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,2611,25300,293497746,0,0,223,11600

In [475]:
ind_2022 = pd.read_csv(DATA_DIR / "labor_2022.csv").drop(
    columns=["own_code", "industry_code", "qtr"]
)
ind_2022["area_fips"] = ind_2022["area_fips"].astype(str).str.zfill(5)
ind_2022

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_38492/1955974371.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  ind_2022 = pd.read_csv(DATA_DIR / "labor_2022.csv").drop(

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,01000,50,0,2022,NaN,Alabama -- Statewide,Total Covered,"10 Total, all industries","State, Total Covered",All establishment sizes,...,9290719237,8.7,841800853,5.1,-48478330,-18.1,57,5.5,2951,5.4
1,01000,51,0,2022,NaN,Alabama -- Statewide,Federal Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,121139973,2.5,0,0.0,0,0.0,52,3.0,2691,3.0
2,01000,51,0,2022,NaN,Alabama -- Statewide,State Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,341991292,5.9,-15729,-3.6,-2004,-37.4,66,5.8,3478,5.8
3,01000,51,0,2022,NaN,Alabama -- Statewide,Local Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,701098314,7.0,4756021,3.5,-546597,-30.6,46,5.0,2390,5.0
4,01000,51,0,2022,NaN,Alabama -- Statewide,Private,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,8126489658,9.4,837060561,5.1,-47929729,-18.0,59,5.7,3046,5.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,US000,95,0,2022,NaN,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,...,72190158731,5.3,2179138215,6.1,-51842769,-21.4,51,4.1,2641,4.1
19252,US000,94,0,2022,NaN,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,...,770328815924,8.1,162185375499,8.8,127404523,0.4,45,3.5,2375,3.5
19253,USCMS,92,0,2022,NaN,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,...,535181314882,7.0,120077517928,8.5,51424249,0.2,39,2.9,2017,2.9
19254,USMSA,91,0,2022,NaN,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,...,616603104921,7.2,132306819289,8.5,-51626434,-0.2,41,3.1,2089,3.0
19255,USNMS,93,0,2022,NaN,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,...,162171651391,14.2,29878556210,10.8,179030957,3.8,84,7.6,4340,7.6

In [476]:
all_ind = pd.concat([ind_1980, ind_2022])
all_ind

,area_fips,agglvl_code,size_code,year,area_title,own_title,industry_title,agglvl_title,size_title,annual_avg_estabs_count,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,US000,1,0,1980,U.S. TOTAL,Total Covered,All Industries,"National, Total Covered",All establishment sizes,4727300,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,01000,18,0,1980,Alabama -- Statewide,Total Covered,All Industries,"State, Total Covered",All establishment sizes,68280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,01001,26,0,1980,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,459,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,01003,26,0,1980,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,1716,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,01005,26,0,1980,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,498,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,US000,95,0,2022,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,303644,...,7.219016e+10,5.3,2.179138e+09,6.1,-51842769.0,-21.4,51.0,4.1,2641.0,4.1
19252,US000,94,0,2022,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,11458436,...,7.703288e+11,8.1,1.621854e+11,8.8,127404523.0,0.4,45.0,3.5,2375.0,3.5
19253,USCMS,92,0,2022,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,8068476,...,5.351813e+11,7.0,1.200775e+11,8.5,51424249.0,0.2,39.0,2.9,2017.0,2.9
19254,USMSA,91,0,2022,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,9115421,...,6.166031e+11,7.2,1.323068e+11,8.5,-51626434.0,-0.2,41.0,3.1,2089.0,3.0
19255,USNMS,93,0,2022,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,2403891,...,1.621717e+11,14.2,2.987856e+10,10.8,179030957.0,3.8,84.0,7.6,4340.0,7.6

In [477]:
# add msa codes to each county
msa_all_ind = all_ind.merge(
    msa_county[["cbsacode", "fips", "cbsatitle"]],
    left_on="area_fips",
    right_on="fips",
    how="inner",
).drop(columns=["area_fips"])
msa_all_ind

,agglvl_code,size_code,year,area_title,own_title,industry_title,agglvl_title,size_title,annual_avg_estabs_count,annual_avg_emplvl,...,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg,cbsacode,fips,cbsatitle
0,26,0,1980,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,459,7986,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,33860,01001,"Montgomery, AL"
1,26,0,1980,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,1716,17387,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,19300,01003,"Daphne-Fairhope-Foley, AL"
2,26,0,1980,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,498,6549,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,21640,01005,"Eufaula, AL-GA"
3,26,0,1980,"Bibb County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,222,3041,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,01007,"Birmingham, AL"
4,26,0,1980,"Blount County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,504,5620,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,01009,"Birmingham, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18469,70,0,2022,"Yauco Municipio, Puerto Rico",Total Covered,"10 Total, all industries","County, Total Covered",All establishment sizes,463,6764,...,11.1,187995.0,23.3,35.0,8.2,1848.0,8.3,38660,72153,"Ponce, PR"
18470,71,0,2022,"Yauco Municipio, Puerto Rico",Federal Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,2,20,...,0.0,0.0,0.0,-7.0,-0.6,-382.0,-0.6,38660,72153,"Ponce, PR"
18471,71,0,2022,"Yauco Municipio, Puerto Rico",State Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,12,902,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,38660,72153,"Ponce, PR"
18472,71,0,2022,"Yauco Municipio, Puerto Rico",Local Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,1,504,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,38660,72153,"Ponce, PR"
18473,71,0,2022,"Yauco Municipio, Puerto Rico",Private,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,448,5339,...,11.1,187995.0,23.3,36.0,8.7,1888.0,8.8,38660,72153,"Ponce, PR"

In [478]:
# keep only rows relevant to bfi dataset
merged_all_ind = msa_all_ind.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="cbsacode",
    right_on="metro13",
    how="inner",
).drop(columns=["cbsacode", "cbsatitle", "fips", "industry_title"])
merged_all_ind = merged_all_ind.query('`own_title` == "Total Covered"')
merged_all_ind

,agglvl_code,size_code,year,area_title,own_title,agglvl_title,size_title,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,...,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg,metro13,metro_title
0,26,0,1980,"Bibb County, Alabama",Total Covered,"County, Total Covered",All establishment sizes,222,3041,28025208,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,"Birmingham-Hoover, AL"
1,26,0,1980,"Blount County, Alabama",Total Covered,"County, Total Covered",All establishment sizes,504,5620,63131224,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,"Birmingham-Hoover, AL"
2,26,0,1980,"Chilton County, Alabama",Total Covered,"County, Total Covered",All establishment sizes,498,4599,42641805,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,"Birmingham-Hoover, AL"
3,26,0,1980,"Jefferson County, Alabama",Total Covered,"County, Total Covered",All establishment sizes,13302,297955,4311240965,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,"Birmingham-Hoover, AL"
4,26,0,1980,"St. Clair County, Alabama",Total Covered,"County, Total Covered",All establishment sizes,579,6437,69024313,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13820,"Birmingham-Hoover, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5565,70,0,2022,"Ozaukee County, Wisconsin",Total Covered,"County, Total Covered",All establishment sizes,3022,40190,2284117082,...,16862632.0,3.5,-835310.0,-13.5,58.0,5.6,2997.0,5.6,33340,"Milwaukee-Waukesha-West Allis, WI"
5570,70,0,2022,"Pierce County, Wisconsin",Total Covered,"County, Total Covered",All establishment sizes,990,10713,467450189,...,3944769.0,3.7,-76625.0,-4.7,22.0,2.7,1165.0,2.7,33460,"Minneapolis-St. Paul-Bloomington, MN-WI"
5575,70,0,2022,"St. Croix County, Wisconsin",Total Covered,"County, Total Covered",All establishment sizes,2473,35341,1861790618,...,26551342.0,6.4,35269.0,0.7,51.0,5.3,2652.0,5.3,33460,"Minneapolis-St. Paul-Bloomington, MN-WI"
5580,70,0,2022,"Washington County, Wisconsin",Total Covered,"County, Total Covered",All establishment sizes,3653,57009,3150911825,...,24085138.0,3.4,-1189642.0,-13.9,60.0,6.0,3095.0,5.9,33340,"Milwaukee-Waukesha-West Allis, WI"
5585,70,0,2022,"Waukesha County, Wisconsin",Total Covered,"County, Total Covered",All establishment sizes,13751,243193,16078127546,...,117401150.0,3.5,-3672944.0,-7.9,43.0,3.5,2240.0,3.5,33340,"Milwaukee-Waukesha-West Allis, WI"

In [479]:
merged_all_ind.columns

Index(['agglvl_code', 'size_code', 'year', 'area_title', 'own_title',
       'agglvl_title', 'size_title', 'annual_avg_estabs_count',
       'annual_avg_emplvl', 'total_annual_wages', 'taxable_annual_wages',
       'annual_contributions', 'annual_avg_wkly_wage', 'avg_annual_pay',
       'disclosure_code', 'lq_disclosure_code', 'lq_annual_avg_estabs_count',
       'lq_annual_avg_emplvl', 'lq_total_annual_wages',
       'lq_taxable_annual_wages', 'lq_annual_contributions',
       'lq_annual_avg_wkly_wage', 'lq_avg_annual_pay', 'oty_disclosure_code',
       'oty_annual_avg_estabs_count_chg',
       'oty_annual_avg_estabs_count_pct_chg', 'oty_annual_avg_emplvl_chg',
       'oty_annual_avg_emplvl_pct_chg', 'oty_total_annual_wages_chg',
       'oty_total_annual_wages_pct_chg', 'oty_taxable_annual_wages_chg',
       'oty_taxable_annual_wages_pct_chg', 'oty_annual_contributions_chg',
       'oty_annual_contributions_pct_chg', 'oty_annual_avg_wkly_wage_chg',
       'oty_annual_avg_wkly_wage_pct_chg', 'oty_avg_annual_pay_chg',
       'oty_avg_annual_pay_pct_chg', 'metro13', 'metro_title'],
      dtype='object')

In [480]:
cols = [
    "metro13",
    "metro_title",
    "year",
    "annual_avg_estabs_count",
    "annual_avg_emplvl",
    "total_annual_wages",
    "annual_avg_wkly_wage",
]

agg_df = merged_all_ind.groupby(["metro13", "metro_title", "year"], as_index=False).agg(
    {
        "annual_avg_estabs_count": "sum",
        "annual_avg_emplvl": "sum",
        "total_annual_wages": "sum",
        "annual_avg_wkly_wage": "mean",
    }
)


msa_tables = {}

for msa, sub in agg_df.groupby("metro_title"):
    table = sub.set_index("year")[
        [
            "annual_avg_estabs_count",
            "annual_avg_emplvl",
            "total_annual_wages",
            "annual_avg_wkly_wage",
        ]
    ].T

    table.index = [
        "Average Establishments",
        "Average Employment (Jobs)",
        "Total Annual Wages ($)",
        "Average Weekly Wage ($)",
    ]

    if len(sub["year"].unique()) > 1:
        years = sorted(sub["year"].unique())
        y0, y1 = years[0], years[-1]
        table["% Change"] = ((table[y1] - table[y0]) / table[y0] * 100).round(2)

    msa_tables[msa] = table.round(2)


for msa, table in msa_tables.items():
    print(f"=== {msa} ===")
    display(table)

=== Akron, OH ===

year                               1980          2022  % Change
Average Establishments     1.227700e+04  1.909000e+04     55.49
Average Employment (Jobs)  2.488110e+05  3.128220e+05     25.73
Total Annual Wages ($)     3.824227e+09  1.809473e+10    373.16
Average Weekly Wage ($)    2.745000e+02  1.075500e+03    291.80

=== Albany-Schenectady-Troy, NY ===

year                               1980          2022  % Change
Average Establishments     1.409800e+04  2.473700e+04     75.46
Average Employment (Jobs)  3.149500e+05  4.318350e+05     37.11
Total Annual Wages ($)     4.380497e+09  3.058013e+10    598.10
Average Weekly Wage ($)    2.484000e+02  1.250400e+03    403.38

=== Albuquerque, NM ===

year                               1980          2022  % Change
Average Establishments     1.218100e+04  2.717900e+04    123.13
Average Employment (Jobs)  1.953800e+05  3.881630e+05     98.67
Total Annual Wages ($)     2.628793e+09  2.201793e+10    737.57
Average Weekly Wage ($)    2.255000e+02  9.565000e+02    324.17

=== Allentown-Bethlehem-Easton, PA-NJ ===

year                               1980          2022  % Change
Average Establishments     1.197900e+04  2.009100e+04     67.72
Average Employment (Jobs)  2.589880e+05  3.621470e+05     39.83
Total Annual Wages ($)     3.706176e+09  2.217330e+10    498.28
Average Weekly Wage ($)    2.595000e+02  1.084500e+03    317.92

=== Atlanta-Sandy Springs-Roswell, GA ===

year                               1980          2022  % Change
Average Establishments     4.512600e+04  2.014640e+05    346.45
Average Employment (Jobs)  1.044004e+06  2.781142e+06    166.39
Total Annual Wages ($)     1.491656e+10  2.031359e+11   1261.81
Average Weekly Wage ($)    2.164800e+02  1.035210e+03    378.19

=== Augusta-Richmond County, GA-SC ===

year                               1980          2022  % Change
Average Establishments     6.060000e+03  1.340800e+04    121.25
Average Employment (Jobs)  1.363910e+05  2.286140e+05     67.62
Total Annual Wages ($)     1.680693e+09  1.273057e+10    657.46
Average Weekly Wage ($)    2.091400e+02  1.058860e+03    406.28

=== Austin-Round Rock, TX ===

year                               1980          2022  % Change
Average Establishments     1.214900e+04  7.556100e+04    521.95
Average Employment (Jobs)  2.480000e+05  1.200015e+06    383.88
Total Annual Wages ($)     3.112674e+09  9.856490e+10   3066.57
Average Weekly Wage ($)    2.088000e+02  1.183000e+03    466.57

=== Bakersfield, CA ===

year                               1980          2022  % Change
Average Establishments     8.239000e+03  2.409500e+04    192.45
Average Employment (Jobs)  1.587850e+05  3.410450e+05    114.78
Total Annual Wages ($)     2.243206e+09  1.874926e+10    735.82
Average Weekly Wage ($)    2.710000e+02  1.057000e+03    290.04

=== Baltimore-Columbia-Towson, MD ===

year                               1980          2022  % Change
Average Establishments     3.742400e+04  7.579500e+04    102.53
Average Employment (Jobs)  9.326290e+05  1.292260e+06     38.56
Total Annual Wages ($)     1.302950e+10  9.292711e+10    613.21
Average Weekly Wage ($)    2.497100e+02  1.286430e+03    415.16

=== Baton Rouge, LA ===

year                               1980          2022  % Change
Average Establishments     1.009000e+04  2.825900e+04    180.07
Average Employment (Jobs)  2.312220e+05  3.898640e+05     68.61
Total Annual Wages ($)     3.561604e+09  2.343371e+10    557.95
Average Weekly Wage ($)    2.575000e+02  1.090200e+03    323.38

=== Birmingham-Hoover, AL ===

year                               1980          2022  % Change
Average Establishments     1.724200e+04  3.365400e+04     95.19
Average Employment (Jobs)  3.504190e+05  5.034430e+05     43.67
Total Annual Wages ($)     4.958184e+09  3.192790e+10    543.94
Average Weekly Wage ($)    2.250000e+02  9.852900e+02    337.90

=== Boise City, ID ===

year                               1980          2022  % Change
Average Establishments     7.098000e+03  3.142700e+04    342.76
Average Employment (Jobs)  1.067830e+05  3.680830e+05    244.70
Total Annual Wages ($)     1.405110e+09  2.173449e+10   1446.82
Average Weekly Wage ($)    2.302000e+02  8.846000e+02    284.27

=== Boston-Cambridge-Newton, MA-NH ===

year                               1980          2022  % Change
Average Establishments     7.586500e+04  1.865620e+05    145.91
Average Employment (Jobs)  1.858828e+06  2.672638e+06     43.78
Total Annual Wages ($)     2.666254e+10  2.610431e+11    879.06
Average Weekly Wage ($)    2.534300e+02  1.590570e+03    527.62

=== Buffalo-Cheektowaga-Niagara Falls, NY ===

year                               1980          2022  % Change
Average Establishments     2.247000e+04  2.993000e+04     33.20
Average Employment (Jobs)  4.867340e+05  5.174360e+05      6.31
Total Annual Wages ($)     6.930058e+09  3.126863e+10    351.20
Average Weekly Wage ($)    2.800000e+02  1.087500e+03    288.39

=== Cape Coral-Fort Myers, FL ===

year                              1980          2022  % Change
Average Establishments          5224.0  2.722700e+04    421.19
Average Employment (Jobs)      67667.0  2.852030e+05    321.48
Total Annual Wages ($)     781039435.0  1.621683e+10   1976.31
Average Weekly Wage ($)          221.0  1.093000e+03    394.57

=== Charleston-North Charleston, SC ===

year                               1980          2022  % Change
Average Establishments     7.131000e+03  2.733700e+04    283.35
Average Employment (Jobs)  1.433030e+05  3.633840e+05    153.58
Total Annual Wages ($)     1.788280e+09  2.219833e+10   1141.32
Average Weekly Wage ($)    2.370000e+02  1.103330e+03    365.54

=== Charlotte-Concord-Gastonia, NC-SC ===

year                               1980          2022  % Change
Average Establishments     2.181600e+04  8.978500e+04    311.56
Average Employment (Jobs)  5.274450e+05  1.284745e+06    143.58
Total Annual Wages ($)     6.683194e+09  9.111630e+10   1263.36
Average Weekly Wage ($)    2.198200e+02  1.077360e+03    390.12

=== Chicago-Naperville-Elgin, IL-IN-WI ===

year                               1980          2022  % Change
Average Establishments     1.265210e+05  2.529930e+05     99.96
Average Employment (Jobs)  3.304141e+06  4.359532e+06     31.94
Total Annual Wages ($)     5.439581e+10  3.332479e+11    512.64
Average Weekly Wage ($)    2.860000e+02  1.167000e+03    308.04

=== Cincinnati, OH-KY-IN ===

year                               1980          2022  % Change
Average Establishments     3.238600e+04  6.317100e+04     95.06
Average Employment (Jobs)  6.750150e+05  1.070325e+06     58.56
Total Annual Wages ($)     1.024068e+10  6.964801e+10    580.11
Average Weekly Wage ($)    2.223300e+02  1.023130e+03    360.18

=== Colorado Springs, CO ===

year                               1980          2022  % Change
Average Establishments     6.007000e+03  2.595000e+04    332.00
Average Employment (Jobs)  1.045980e+05  3.047640e+05    191.37
Total Annual Wages ($)     1.317441e+09  1.878489e+10   1325.86
Average Weekly Wage ($)    2.020000e+02  1.062000e+03    425.74

=== Columbia, SC ===

year                               1980          2022  % Change
Average Establishments     9.406000e+03  2.229400e+04    137.02
Average Employment (Jobs)  1.989160e+05  3.821870e+05     92.13
Total Annual Wages ($)     2.448931e+09  2.084152e+10    751.05
Average Weekly Wage ($)    2.320000e+02  9.875000e+02    325.65

=== Columbus, OH ===

year                               1980          2022  % Change
Average Establishments     2.598100e+04  5.736900e+04    120.81
Average Employment (Jobs)  5.523390e+05  1.060330e+06     91.97
Total Annual Wages ($)     7.801919e+09  6.882312e+10    782.13
Average Weekly Wage ($)    2.485000e+02  1.021600e+03    311.11

=== Dallas-Fort Worth-Arlington, TX ===

year                               1980          2022  % Change
Average Establishments     6.553400e+04  2.105240e+05    221.24
Average Employment (Jobs)  1.446372e+06  3.852632e+06    166.37
Total Annual Wages ($)     2.193468e+10  2.892660e+11   1218.76
Average Weekly Wage ($)    2.358200e+02  1.167820e+03    395.22

=== Deltona-Daytona Beach-Ormond Beach, FL ===

year                              1980          2022  % Change
Average Establishments          6160.0  1.975000e+04    220.62
Average Employment (Jobs)      80194.0  2.076590e+05    158.95
Total Annual Wages ($)     845754238.0  1.025019e+10   1111.96
Average Weekly Wage ($)          207.0  9.200000e+02    344.44

=== Denver-Aurora-Lakewood, CO ===

year                               1980          2022  % Change
Average Establishments     3.259400e+04  1.288340e+05    295.27
Average Employment (Jobs)  7.068340e+05  1.569792e+06    122.09
Total Annual Wages ($)     1.116408e+10  1.295870e+11   1060.75
Average Weekly Wage ($)    2.528900e+02  1.398200e+03    452.89

=== Des Moines-West Des Moines, IA ===

year                               1980          2022  % Change
Average Establishments     1.173100e+04  2.660300e+04    126.78
Average Employment (Jobs)  2.027670e+05  3.856250e+05     90.18
Total Annual Wages ($)     2.821917e+09  2.591840e+10    818.47
Average Weekly Wage ($)    2.188300e+02  1.051330e+03    380.43

=== Detroit-Warren-Dearborn, MI ===

year                               1980          2022  % Change
Average Establishments     6.267100e+04  1.125780e+05     79.63
Average Employment (Jobs)  1.602429e+06  1.889827e+06     17.94
Total Annual Wages ($)     2.935221e+10  1.316722e+11    348.59
Average Weekly Wage ($)    3.050000e+02  1.167830e+03    282.90

=== El Paso, TX ===

year                               1980          2022  % Change
Average Establishments     7.342000e+03  1.689900e+04    130.17
Average Employment (Jobs)  1.592050e+05  3.195150e+05    100.69
Total Annual Wages ($)     1.831117e+09  1.504185e+10    721.46
Average Weekly Wage ($)    2.165000e+02  1.112500e+03    413.86

=== Fayetteville-Springdale-Rogers, AR-MO ===

year                               1980          2022  % Change
Average Establishments     3.882000e+03  1.461900e+04    276.58
Average Employment (Jobs)  6.504100e+04  2.545510e+05    291.37
Total Annual Wages ($)     7.178908e+08  1.645344e+10   2191.91
Average Weekly Wage ($)    1.986700e+02  1.094670e+03    451.01

=== Fresno, CA ===

year                               1980          2022  % Change
Average Establishments     1.699900e+04  4.527600e+04    166.35
Average Employment (Jobs)  2.540180e+05  4.661730e+05     83.52
Total Annual Wages ($)     3.024914e+09  2.505820e+10    728.39
Average Weekly Wage ($)    2.180000e+02  1.021000e+03    368.35

=== Grand Rapids-Wyoming, MI ===

year                               1980          2022  % Change
Average Establishments     1.184200e+04  2.768800e+04    133.81
Average Employment (Jobs)  2.870170e+05  5.800250e+05    102.09
Total Annual Wages ($)     4.160216e+09  3.348732e+10    704.94
Average Weekly Wage ($)    2.634000e+02  9.764000e+02    270.69

=== Greensboro-High Point, NC ===

year                               1980          2022  % Change
Average Establishments     9.619000e+03  2.165700e+04    125.15
Average Employment (Jobs)  2.418000e+05  3.521960e+05     45.66
Total Annual Wages ($)     3.082059e+09  1.945814e+10    531.34
Average Weekly Wage ($)    2.290000e+02  9.390000e+02    310.04

=== Greenville-Anderson-Mauldin, SC ===

year                               1980          2022  % Change
Average Establishments     1.040300e+04  2.605100e+04    150.42
Average Employment (Jobs)  2.345890e+05  4.147920e+05     76.82
Total Annual Wages ($)     2.912307e+09  2.284288e+10    684.36
Average Weekly Wage ($)    2.267500e+02  9.752500e+02    330.10

=== Harrisburg-Carlisle, PA ===

year                               1980          2022  % Change
Average Establishments     8.240000e+03  1.544800e+04     87.48
Average Employment (Jobs)  2.128020e+05  3.263550e+05     53.36
Total Annual Wages ($)     2.962202e+09  2.042738e+10    589.60
Average Weekly Wage ($)    2.363300e+02  1.057000e+03    347.25

=== Houston-The Woodlands-Sugar Land, TX ===

year                               1980          2022  % Change
Average Establishments     6.098800e+04  1.776490e+05    191.29
Average Employment (Jobs)  1.516682e+06  3.105288e+06    104.74
Total Annual Wages ($)     2.630776e+10  2.375192e+11    802.85
Average Weekly Wage ($)    2.771000e+02  1.171500e+03    322.77

=== Indianapolis-Carmel-Anderson, IN ===

year                               1980          2022  % Change
Average Establishments     2.461000e+04  5.616500e+04    128.22
Average Employment (Jobs)  5.557560e+05  1.054200e+06     89.69
Total Annual Wages ($)     8.286154e+09  6.742924e+10    713.76
Average Weekly Wage ($)    2.316400e+02  9.971800e+02    330.49

=== Jacksonville, FL ===

year                               1980          2022  % Change
Average Establishments     1.507300e+04  5.323100e+04    253.15
Average Employment (Jobs)  2.833240e+05  7.256880e+05    156.13
Total Annual Wages ($)     3.694286e+09  4.549733e+10   1131.56
Average Weekly Wage ($)    2.272000e+02  1.012200e+03    345.51

=== Kansas City, MO-KS ===

year                               1980          2022  % Change
Average Establishments     3.273900e+04  7.194500e+04    119.75
Average Employment (Jobs)  6.420520e+05  1.052987e+06     64.00
Total Annual Wages ($)     9.377335e+09  6.775592e+10    622.55
Average Weekly Wage ($)    2.330700e+02  9.793600e+02    320.20

=== Knoxville, TN ===

year                               1980          2022  % Change
Average Establishments     9.438000e+03  2.448500e+04    159.43
Average Employment (Jobs)  2.140200e+05  4.041900e+05     88.86
Total Annual Wages ($)     2.790519e+09  2.453980e+10    779.40
Average Weekly Wage ($)    2.222200e+02  1.062440e+03    378.10

=== Lakeland-Winter Haven, FL ===

year                               1980          2022  % Change
Average Establishments     6.559000e+03  1.775100e+04    170.64
Average Employment (Jobs)  1.243950e+05  2.531340e+05    103.49
Total Annual Wages ($)     1.566708e+09  1.305092e+10    733.02
Average Weekly Wage ($)    2.420000e+02  9.910000e+02    309.50

=== Las Vegas-Henderson-Paradise, NV ===

year                               1980          2022  % Change
Average Establishments     9.610000e+03  6.271400e+04    552.59
Average Employment (Jobs)  2.161080e+05  1.056764e+06    389.00
Total Annual Wages ($)     3.057868e+09  6.341412e+10   1973.80
Average Weekly Wage ($)    2.720000e+02  1.154000e+03    324.26

=== Little Rock-North Little Rock-Conway, AR ===

year                               1980          2022  % Change
Average Establishments     1.072300e+04  2.163000e+04    101.72
Average Employment (Jobs)  1.981950e+05  3.406120e+05     71.86
Total Annual Wages ($)     2.587214e+09  1.902614e+10    635.39
Average Weekly Wage ($)    1.910000e+02  9.033300e+02    372.95

=== Los Angeles-Long Beach-Anaheim, CA ===

year                               1980          2022  % Change
Average Establishments     1.966460e+05  6.746940e+05    243.10
Average Employment (Jobs)  4.443594e+06  6.113834e+06     37.59
Total Annual Wages ($)     7.141932e+10  4.762071e+11    566.78
Average Weekly Wage ($)    3.010000e+02  1.488500e+03    394.52

=== Louisville/Jefferson County, KY-IN ===

year                               1980          2022  % Change
Average Establishments     1.779200e+04  4.455900e+04    150.44
Average Employment (Jobs)  3.992220e+05  6.640250e+05     66.33
Total Annual Wages ($)     5.572647e+09  4.094202e+10    634.70
Average Weekly Wage ($)    2.181700e+02  9.671700e+02    343.32

=== Madison, WI ===

year                               1980          2022  % Change
Average Establishments     9.653000e+03  2.067000e+04    114.13
Average Employment (Jobs)  2.004910e+05  3.919410e+05     95.49
Total Annual Wages ($)     2.682591e+09  2.651831e+10    888.53
Average Weekly Wage ($)    2.160000e+02  1.072500e+03    396.53

=== McAllen-Edinburg-Mission, TX ===

year                              1980          2022  % Change
Average Establishments          4419.0  1.374600e+04    211.07
Average Employment (Jobs)      76625.0  2.801340e+05    265.59
Total Annual Wages ($)     758479227.0  1.142730e+10   1406.61
Average Weekly Wage ($)          190.0  7.840000e+02    312.63

=== Memphis, TN-MS-AR ===

year                               1980          2022  % Change
Average Establishments     1.643200e+04  3.099300e+04     88.61
Average Employment (Jobs)  3.657680e+05  6.233710e+05     70.43
Total Annual Wages ($)     4.884345e+09  3.885526e+10    695.51
Average Weekly Wage ($)    1.922200e+02  9.028900e+02    369.71

=== Miami-Fort Lauderdale-West Palm Beach, FL ===

year                               1980          2022  % Change
Average Establishments     4.043700e+04  2.682550e+05    563.39
Average Employment (Jobs)  5.618360e+05  2.661604e+06    373.73
Total Annual Wages ($)     7.355152e+09  1.862822e+11   2432.68
Average Weekly Wage ($)    2.515000e+02  1.343670e+03    434.26

=== Milwaukee-Waukesha-West Allis, WI ===

year                               1980          2022  % Change
Average Establishments     2.800100e+04  4.824000e+04     72.28
Average Employment (Jobs)  6.375270e+05  8.041890e+05     26.14
Total Annual Wages ($)     9.694970e+09  5.146573e+10    430.85
Average Weekly Wage ($)    2.685000e+02  1.167250e+03    334.73

=== Minneapolis-St. Paul-Bloomington, MN-WI ===

year                               1980          2022  % Change
Average Establishments     4.981000e+04  1.054090e+05    111.62
Average Employment (Jobs)  1.099807e+06  1.892474e+06     72.07
Total Annual Wages ($)     1.636441e+10  1.411531e+11    762.56
Average Weekly Wage ($)    2.328000e+02  1.112400e+03    377.84

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===

year                               1980          2022  % Change
Average Establishments     1.638300e+04  6.876900e+04    319.76
Average Employment (Jobs)  3.788240e+05  1.050322e+06    177.26
Total Annual Wages ($)     4.882470e+09  7.308186e+10   1396.82
Average Weekly Wage ($)    2.132900e+02  1.048290e+03    391.49

=== New Orleans-Metairie, LA ===

year                               1980          2022  % Change
Average Establishments     2.076000e+04  3.650500e+04     75.84
Average Employment (Jobs)  5.327510e+05  4.327180e+05    -18.78
Total Annual Wages ($)     7.969945e+09  2.736926e+10    243.41
Average Weekly Wage ($)    3.251400e+02  1.295570e+03    298.46

=== New York-Newark-Jersey City, NY-NJ-PA ===

year                               1980          2022  % Change
Average Establishments     3.900040e+05  6.548050e+05     67.90
Average Employment (Jobs)  6.788655e+06  9.033523e+06     33.07
Total Annual Wages ($)     1.100103e+11  8.572622e+11    679.26
Average Weekly Wage ($)    2.804100e+02  1.472000e+03    424.95

=== North Port-Sarasota-Bradenton, FL ===

year                               1980          2022  % Change
Average Establishments     9.145000e+03  3.298100e+04    260.65
Average Employment (Jobs)  1.160740e+05  3.141710e+05    170.66
Total Annual Wages ($)     1.315878e+09  1.826164e+10   1287.79
Average Weekly Wage ($)    2.165000e+02  1.111000e+03    413.16

=== Ogden-Clearfield, UT ===

year                               1980          2022  % Change
Average Establishments     5.258000e+03  1.783300e+04    239.16
Average Employment (Jobs)  9.099500e+04  2.581980e+05    183.75
Total Annual Wages ($)     1.207999e+09  1.393904e+10   1053.90
Average Weekly Wage ($)    2.530000e+02  1.018000e+03    302.37

=== Oklahoma City, OK ===

year                               1980          2022  % Change
Average Establishments     1.807800e+04  4.561200e+04    152.31
Average Employment (Jobs)  3.878870e+05  6.356290e+05     63.87
Total Annual Wages ($)     5.505146e+09  3.619385e+10    557.45
Average Weekly Wage ($)    2.222900e+02  9.162900e+02    312.21

=== Omaha-Council Bluffs, NE-IA ===

year                               1980          2022  % Change
Average Establishments     1.458800e+04  2.999500e+04    105.61
Average Employment (Jobs)  2.713810e+05  4.767980e+05     75.69
Total Annual Wages ($)     3.642715e+09  2.954197e+10    710.99
Average Weekly Wage ($)    2.153800e+02  1.025620e+03    376.20

=== Orlando-Kissimmee-Sanford, FL ===

year                               1980          2022  % Change
Average Establishments     1.780700e+04  9.156700e+04    414.22
Average Employment (Jobs)  3.195600e+05  1.320781e+06    313.31
Total Annual Wages ($)     3.901618e+09  7.875062e+10   1918.41
Average Weekly Wage ($)    2.132500e+02  1.054500e+03    394.49

=== Oxnard-Thousand Oaks-Ventura, CA ===

year                               1980          2022  % Change
Average Establishments     8.950000e+03  2.921400e+04    226.41
Average Employment (Jobs)  1.651830e+05  3.282040e+05     98.69
Total Annual Wages ($)     2.326728e+09  2.168213e+10    831.87
Average Weekly Wage ($)    2.700000e+02  1.270000e+03    370.37

=== Palm Bay-Melbourne-Titusville, FL ===

year                               1980          2022  % Change
Average Establishments     5.237000e+03  1.832400e+04    249.89
Average Employment (Jobs)  1.012250e+05  2.314090e+05    128.61
Total Annual Wages ($)     1.455979e+09  1.428344e+10    881.02
Average Weekly Wage ($)    2.760000e+02  1.187000e+03    330.07

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===

year                               1980          2022  % Change
Average Establishments     9.527400e+04  1.763770e+05     85.13
Average Employment (Jobs)  2.049334e+06  2.791395e+06     36.21
Total Annual Wages ($)     3.096890e+10  2.072772e+11    569.31
Average Weekly Wage ($)    2.510900e+02  1.334000e+03    431.28

=== Phoenix-Mesa-Scottsdale, AZ ===

year                               1980          2022  % Change
Average Establishments     3.302600e+04  1.350150e+05    308.81
Average Employment (Jobs)  6.678040e+05  2.239697e+06    235.38
Total Annual Wages ($)     9.440978e+09  1.513660e+11   1503.29
Average Weekly Wage ($)    2.690000e+02  1.168000e+03    334.20

=== Pittsburgh, PA ===

year                               1980          2022  % Change
Average Establishments     4.769300e+04  6.657300e+04     39.59
Average Employment (Jobs)  1.033967e+06  1.087689e+06      5.20
Total Annual Wages ($)     1.607362e+10  7.272149e+10    352.43
Average Weekly Wage ($)    2.810000e+02  1.099750e+03    291.37

=== Portland-Vancouver-Hillsboro, OR-WA ===

year                               1980          2022  % Change
Average Establishments     3.315100e+04  1.050910e+05    217.01
Average Employment (Jobs)  5.698260e+05  1.204785e+06    111.43
Total Annual Wages ($)     8.675721e+09  8.963597e+10    933.18
Average Weekly Wage ($)    3.037100e+02  1.229710e+03    304.89

=== Providence-Warwick, RI-MA ===

year                               1980          2022  % Change
Average Establishments     3.189100e+04  5.920800e+04     85.66
Average Employment (Jobs)  5.628720e+05  6.934840e+05     23.20
Total Annual Wages ($)     6.825301e+09  4.329570e+10    534.34
Average Weekly Wage ($)    2.323300e+02  1.155170e+03    397.20

=== Provo-Orem, UT ===

year                              1980          2022  % Change
Average Establishments          3866.0  2.171300e+04    461.64
Average Employment (Jobs)      57067.0  2.908460e+05    409.66
Total Annual Wages ($)     744060557.0  1.682072e+10   2160.67
Average Weekly Wage ($)          234.0  9.870000e+02    321.79

=== Raleigh, NC ===

year                               1980          2022  % Change
Average Establishments     7.977000e+03  5.228600e+04    555.46
Average Employment (Jobs)  1.796620e+05  6.870810e+05    282.43
Total Annual Wages ($)     2.245160e+09  4.800551e+10   2038.18
Average Weekly Wage ($)    2.076700e+02  1.103330e+03    431.30

=== Richmond, VA ===

year                               1980          2022  % Change
Average Establishments     1.501300e+04  4.544500e+04    202.70
Average Employment (Jobs)  3.736920e+05  6.377560e+05     70.66
Total Annual Wages ($)     5.100791e+09  4.182454e+10    719.96
Average Weekly Wage ($)    2.261200e+02  1.115060e+03    393.13

=== Riverside-San Bernardino-Ontario, CA ===

year                               1980          2022  % Change
Average Establishments     2.542700e+04  1.451350e+05    470.79
Average Employment (Jobs)  4.458820e+05  1.642883e+06    268.46
Total Annual Wages ($)     6.001447e+09  9.278753e+10   1446.09
Average Weekly Wage ($)    2.575000e+02  1.085500e+03    321.55

=== Rochester, NY ===

year                               1980          2022  % Change
Average Establishments     1.659700e+04  2.708400e+04     63.19
Average Employment (Jobs)  4.075160e+05  4.818990e+05     18.25
Total Annual Wages ($)     6.508217e+09  2.910515e+10    347.21
Average Weekly Wage ($)    2.480000e+02  1.068600e+03    330.89

=== Sacramento--Roseville--Arden-Arcade, CA ===

year                               1980          2022  % Change
Average Establishments     2.546800e+04  9.434700e+04    270.45
Average Employment (Jobs)  4.191740e+05  1.046191e+06    149.58
Total Annual Wages ($)     6.436893e+09  7.558499e+10   1074.25
Average Weekly Wage ($)    2.582500e+02  1.326750e+03    413.75

=== Salt Lake City, UT ===

year                               1980          2022  % Change
Average Establishments     1.771700e+04  6.419100e+04    262.31
Average Employment (Jobs)  2.836110e+05  7.905260e+05    178.74
Total Annual Wages ($)     3.988065e+09  5.526498e+10   1285.76
Average Weekly Wage ($)    2.815000e+02  1.138000e+03    304.26

=== San Antonio-New Braunfels, TX ===

year                               1980          2022  % Change
Average Establishments     1.912100e+04  5.816000e+04    204.17
Average Employment (Jobs)  4.057890e+05  1.069484e+06    163.56
Total Annual Wages ($)     5.103797e+09  6.421519e+10   1158.18
Average Weekly Wage ($)    1.996200e+02  1.010750e+03    406.32

=== San Diego-Carlsbad, CA ===

year                               1980          2022  % Change
Average Establishments     3.376400e+04  1.238400e+05    266.78
Average Employment (Jobs)  6.643870e+05  1.507661e+06    126.93
Total Annual Wages ($)     9.381740e+09  1.159666e+11   1136.09
Average Weekly Wage ($)    2.710000e+02  1.479000e+03    445.76

=== San Francisco-Oakland-Hayward, CA ===

year                               1980          2022  % Change
Average Establishments     7.675200e+04  2.096180e+05    173.11
Average Employment (Jobs)  1.557968e+06  2.423136e+06     55.53
Total Annual Wages ($)     2.597530e+10  2.963717e+11   1040.97
Average Weekly Wage ($)    3.084000e+02  2.234400e+03    624.51

=== San Jose-Sunnyvale-Santa Clara, CA ===

year                               1980          2022  % Change
Average Establishments     2.628900e+04  7.922300e+04    201.35
Average Employment (Jobs)  6.856960e+05  1.135033e+06     65.53
Total Annual Wages ($)     1.149798e+10  1.885038e+11   1539.45
Average Weekly Wage ($)    2.660000e+02  2.159500e+03    711.84

=== Seattle-Tacoma-Bellevue, WA ===

year                               1980          2022  % Change
Average Establishments     5.130600e+04  1.373450e+05    167.70
Average Employment (Jobs)  9.052410e+05  2.063430e+06    127.94
Total Annual Wages ($)     1.506654e+10  2.072826e+11   1275.78
Average Weekly Wage ($)    3.076700e+02  1.608000e+03    422.64

=== Spokane-Spokane Valley, WA ===

year                               1980          2022  % Change
Average Establishments     8.345000e+03  1.817500e+04    117.80
Average Employment (Jobs)  1.296910e+05  2.491810e+05     92.13
Total Annual Wages ($)     1.822148e+09  1.471632e+10    707.64
Average Weekly Wage ($)    2.675000e+02  1.031000e+03    285.42

=== Springfield, MA ===

year                               1980          2022  % Change
Average Establishments     7.962000e+03  2.009200e+04    152.35
Average Employment (Jobs)  1.874870e+05  2.055830e+05      9.65
Total Annual Wages ($)     2.407259e+09  1.183422e+10    391.61
Average Weekly Wage ($)    2.460000e+02  1.107000e+03    350.00

=== St. Louis, MO-IL ===

year                               1980          2022  % Change
Average Establishments     4.576000e+04  9.345500e+04    104.23
Average Employment (Jobs)  9.871000e+05  1.305367e+06     32.24
Total Annual Wages ($)     1.474525e+10  8.378327e+10    468.21
Average Weekly Wage ($)    2.304700e+02  9.588000e+02    316.03

=== Stockton-Lodi, CA ===

year                               1980          2022  % Change
Average Establishments     8.563000e+03  2.014500e+04    135.26
Average Employment (Jobs)  1.337760e+05  2.801680e+05    109.43
Total Annual Wages ($)     1.792988e+09  1.621045e+10    804.10
Average Weekly Wage ($)    2.570000e+02  1.113000e+03    333.07

=== Syracuse, NY ===

year                               1980          2022  % Change
Average Establishments     1.184000e+04  1.683200e+04     42.16
Average Employment (Jobs)  2.480820e+05  2.906050e+05     17.14
Total Annual Wages ($)     3.590966e+09  1.807297e+10    403.29
Average Weekly Wage ($)    2.596700e+02  1.102330e+03    324.52

=== Tampa-St. Petersburg-Clearwater, FL ===

year                               1980          2022  % Change
Average Establishments     3.231700e+04  1.114460e+05    244.85
Average Employment (Jobs)  5.506730e+05  1.382934e+06    151.14
Total Annual Wages ($)     6.718945e+09  8.782282e+10   1207.09
Average Weekly Wage ($)    2.157500e+02  1.085000e+03    402.90

=== Toledo, OH ===

year                               1980          2022  % Change
Average Establishments     1.216800e+04  1.521200e+04     25.02
Average Employment (Jobs)  2.420790e+05  2.862020e+05     18.23
Total Annual Wages ($)     3.769892e+09  1.615327e+10    328.48
Average Weekly Wage ($)    2.763300e+02  1.056330e+03    282.27

=== Tucson, AZ ===

year                               1980          2022  % Change
Average Establishments     9.759000e+03  2.198400e+04    125.27
Average Employment (Jobs)  1.781980e+05  3.778630e+05    112.05
Total Annual Wages ($)     2.413797e+09  2.158418e+10    794.20
Average Weekly Wage ($)    2.600000e+02  1.098000e+03    322.31

=== Tulsa, OK ===

year                               1980          2022  % Change
Average Establishments     1.474800e+04  3.115900e+04    111.28
Average Employment (Jobs)  3.000890e+05  4.319790e+05     43.95
Total Annual Wages ($)     4.519553e+09  2.460021e+10    444.31
Average Weekly Wage ($)    2.384300e+02  9.428600e+02    295.45

=== Urban Honolulu, HI ===

year                               1980          2022  % Change
Average Establishments     1.543200e+04  2.920800e+04     89.27
Average Employment (Jobs)  3.369170e+05  4.393550e+05     30.40
Total Annual Wages ($)     4.624177e+09  2.806616e+10    506.94
Average Weekly Wage ($)    2.630000e+02  1.228000e+03    366.92

=== Virginia Beach-Norfolk-Newport News, VA-NC ===

year                               1980          2022  % Change
Average Establishments     1.832000e+04  4.831100e+04    163.71
Average Employment (Jobs)  4.387270e+05  7.394440e+05     68.54
Total Annual Wages ($)     5.541218e+09  4.282138e+10    672.78
Average Weekly Wage ($)    2.164400e+02  1.029560e+03    375.67

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===

year                               1980          2022  % Change
Average Establishments     4.677000e+04  2.165240e+05    362.95
Average Employment (Jobs)  1.041228e+06  3.091195e+06    196.88
Total Annual Wages ($)     1.541905e+10  2.840875e+11   1742.44
Average Weekly Wage ($)    2.306500e+02  1.328000e+03    475.76

=== Wichita, KS ===

year                               1980          2022  % Change
Average Establishments     1.141500e+04  1.642800e+04     43.92
Average Employment (Jobs)  2.181590e+05  2.937200e+05     34.64
Total Annual Wages ($)     3.178409e+09  1.609758e+10    406.47
Average Weekly Wage ($)    2.417500e+02  9.135000e+02    277.87

=== Winston-Salem, NC ===

year                               1980          2022  % Change
Average Establishments     6.812000e+03  1.657800e+04    143.36
Average Employment (Jobs)  1.785250e+05  2.672450e+05     49.70
Total Annual Wages ($)     2.421563e+09  1.558144e+10    543.45
Average Weekly Wage ($)    2.176000e+02  9.318000e+02    328.22

=== Worcester, MA-CT ===

year                               1980          2022  % Change
Average Establishments     1.162200e+04  2.897400e+04    149.30
Average Employment (Jobs)  2.585480e+05  3.509800e+05     35.75
Total Annual Wages ($)     3.318163e+09  2.351304e+10    608.62
Average Weekly Wage ($)    2.460000e+02  1.288000e+03    423.58

# Merge into large dataset with BFI

In [481]:
bfi_df1980 = bfi_df.copy()
bfi_df1980["year"] = 1980
bfi_df2022 = bfi_df.copy()
bfi_df2022["year"] = 2022
bfi_yrs = pd.concat([bfi_df1980, bfi_df2022])
print(bfi_yrs.head())
print(bfi_yrs.tail())

  metro13 metro_title  change_ln_population  not_lbfr_share_prime_change  \
0   00001          AL              0.006923                     -0.01089
1   00005          AR             -0.027700                     -0.02280
2   00006          CA              0.360200                     -0.07647
3   00008          CO              0.419600                     -0.09702
4   00012          FL              0.463400                     -0.05614

   unemployed_share_prime_change  non_hc_share_prime_change  \
0                       -0.01635                  -0.020300
1                       -0.01652                  -0.009817
2                       -0.02523                   0.080720
3                       -0.01325                   0.087190
4                       -0.00591                   0.031780

   hc_emp_share_prime_change  manu_share_prime_change  \
0                    0.04754                -0.109100
1                    0.04915                -0.034590
2                    0.02098                -0.026890
3                    0.02308                 0.008112
4                    0.03028                -0.065120

   non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
0                      0.13640                        0.24990  ...
1                      0.07392                        0.18920  ...
2                      0.12860                        0.07481  ...
3                      0.10220                        0.03467  ...
4                      0.12720                        0.09937  ...

   change_earnings  college1980  college2022  change_college  \
0           0.4585      0.07756       0.1600         0.08243
1           0.4778      0.07879       0.1613         0.08254
2           0.5453      0.13910       0.2361         0.09704
3           0.5516      0.15570       0.3569         0.20120
4           0.3837      0.14390       0.2902         0.14630

   healthcare_share_prime2022  healthcare_share_prime1980  \
0                     0.08564                     0.03810
1                     0.08988                     0.04074
2                     0.06424                     0.04326
3                     0.06779                     0.04471
4                     0.09054                     0.06027

   change_non_hc_share_lbfr  change_ln_non_hc  non_hc_manu_share_prime_change  \
0                  -0.05360           0.01936                        0.088800
1                  -0.05038           0.02297                        0.024760
2                  -0.02911           0.38450                        0.107610
3                  -0.02375           0.52890                        0.079078
4                  -0.03358           0.52410                        0.096890

   year
0  1980
1  1980
2  1980
3  1980
4  1980

[5 rows x 27 columns]
    metro13                                   metro_title  \
125   47260    Virginia Beach-Norfolk-Newport News, VA-NC
126   47900  Washington-Arlington-Alexandria, DC-VA-MD-WV
127   48620                                   Wichita, KS
128   49180                             Winston-Salem, NC
129   49340                              Worcester, MA-CT

     change_ln_population  not_lbfr_share_prime_change  \
125                0.3525                    -0.068140
126                0.6018                    -0.060330
127                0.3014                    -0.041580
128                0.4209                     0.003533
129                0.2309                    -0.049690

     unemployed_share_prime_change  non_hc_share_prime_change  \
125                      -0.000817                   0.031050
126                       0.002283                   0.037890
127                       0.019200                   0.006006
128                       0.004468                  -0.082680
129                       0.003451                   0.018820

     hc_emp_share_prime_change  manu_share_prime_change  \
125                    0.03791                -0.045280
126                    0.02016                -0.006818
127                    0.01637                -0.103900
128                    0.07468                -0.193400
129                    0.02742                -0.159300

     non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
125                      0.11420                        0.10720  ...
126                      0.06487                        0.03223  ...
127                      0.12630                        0.24270  ...
128                      0.18540                        0.30930  ...
129                      0.20560                        0.25970  ...

     change_earnings  college1980  college2022  change_college  \
125           0.5376       0.1373       0.3181          0.1808
126           0.5548       0.2813       0.4991          0.2178
127           0.2752       0.1600       0.2932          0.1332
128           0.4411       0.1284       0.2859          0.1575
129           0.6015       0.1441       0.3408          0.1967

     healthcare_share_prime2022  healthcare_share_prime1980  \
125                     0.08881                     0.05090
126                     0.07075                     0.05059
127                     0.08197                     0.06561
128                     0.12600                     0.05134
129                     0.09974                     0.07232

     change_non_hc_share_lbfr  change_ln_non_hc  \
125                  -0.03976            0.3924
126                  -0.01901            0.6537
127                  -0.01459            0.3115
128                  -0.07418            0.3126
129                  -0.02726            0.3273

     non_hc_manu_share_prime_change  year
125                        0.076327  2022
126                        0.044705  2022
127                        0.109910  2022
128                        0.110719  2022
129                        0.178119  2022

[5 rows x 27 columns]

In [482]:
# merge population dataframes
tot_final_pop_1980 = final_pop_1980.query("`AGEGRP` == 0")
min_df_2022["year"] = 2022
pop_df = pd.concat([final_pop_1980, min_df_2022], ignore_index=True, axis=0).drop(
    ["AGEGRP"], axis=1
)
pop_df

,year,metro13,metro_title,TOT_POP,TOT_MALE,TOT_FEMALE,BAC_FEMALE,BAC_MALE,OTHER_FEMALE,OTHER_MALE,WAC_FEMALE,WAC_MALE
0,1980.0,10420,"Akron, OH",660527.0,319350.0,341177.0,32098.0,28286.0,2206.0,2053.0,306873.0,289011.0
1,1980.0,10420,"Akron, OH",45259.0,23291.0,21968.0,2811.0,2910.0,195.0,194.0,18962.0,20187.0
2,1980.0,10420,"Akron, OH",47257.0,24305.0,22952.0,2909.0,2960.0,213.0,204.0,19830.0,21141.0
3,1980.0,10420,"Akron, OH",53300.0,27183.0,26117.0,2917.0,3112.0,188.0,179.0,23012.0,23892.0
4,1980.0,10420,"Akron, OH",63374.0,31723.0,31651.0,3479.0,3297.0,185.0,174.0,27987.0,28252.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1599,2022.0,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1340607.0,655375.0,685232.0,145369.0,132463.0,248433.0,240697.0,445414.0,437406.0
1600,2022.0,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1788040.0,858316.0,929724.0,553959.0,476844.0,218129.0,223829.0,336201.0,346238.0
1601,2022.0,48620,"Wichita, KS",649687.0,323930.0,325757.0,32296.0,32740.0,72626.0,73607.0,281438.0,280340.0
1602,2022.0,49180,"Winston-Salem, NC",688799.0,333034.0,355765.0,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0
1603,2022.0,49340,"Worcester, MA-CT",862873.0,428468.0,434405.0,35478.0,36689.0,91948.0,90741.0,377521.0,371370.0

In [483]:
new_bfi_df = bfi_yrs.merge(
    pop_df.drop(columns="metro_title"),
    on=["metro13", "year"],
    how="left",
).merge(
    merged_all_ind[
        [
            "metro13",
            "year",
            "annual_avg_estabs_count",
            "annual_avg_emplvl",
            "total_annual_wages",
            "annual_avg_wkly_wage",
        ]
    ],
    on=["metro13", "year"],
    how="left",
)
new_bfi_df = new_bfi_df.rename(
    columns={
        "race/sex indicator": "race/sex_indicator",
        "total population": "total_population",
    }
)
new_bfi_df

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,BAC_FEMALE,BAC_MALE,OTHER_FEMALE,OTHER_MALE,WAC_FEMALE,WAC_MALE,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,annual_avg_wkly_wage
0,00001,AL,0.006923,-0.010890,-0.016350,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,00005,AR,-0.027700,-0.022800,-0.016520,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,00006,CA,0.360200,-0.076470,-0.025230,0.080720,0.02098,-0.026890,0.12860,0.07481,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,00008,CO,0.419600,-0.097020,-0.013250,0.087190,0.02308,0.008112,0.10220,0.03467,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,00012,FL,0.463400,-0.056140,-0.005910,0.031780,0.03028,-0.065120,0.12720,0.09937,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10072,49180,"Winston-Salem, NC",0.420900,0.003533,0.004468,-0.082680,0.07468,-0.193400,0.18540,0.30930,...,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0,1037.0,13461.0,6.478641e+08,926.0
10073,49180,"Winston-Salem, NC",0.420900,0.003533,0.004468,-0.082680,0.07468,-0.193400,0.18540,0.30930,...,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0,10743.0,190891.0,1.194026e+10,1203.0
10074,49180,"Winston-Salem, NC",0.420900,0.003533,0.004468,-0.082680,0.07468,-0.193400,0.18540,0.30930,...,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0,807.0,7413.0,2.825179e+08,733.0
10075,49180,"Winston-Salem, NC",0.420900,0.003533,0.004468,-0.082680,0.07468,-0.193400,0.18540,0.30930,...,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0,766.0,10004.0,4.339024e+08,834.0
10076,49340,"Worcester, MA-CT",0.230900,-0.049690,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,35478.0,36689.0,91948.0,90741.0,377521.0,371370.0,28974.0,350980.0,2.351304e+10,1288.0

In [484]:
new_bfi_df.columns

Index(['metro13', 'metro_title', 'change_ln_population',
       'not_lbfr_share_prime_change', 'unemployed_share_prime_change',
       'non_hc_share_prime_change', 'hc_emp_share_prime_change',
       'manu_share_prime_change', 'non_manu_share_prime_change',
       'manufacturing_share_prime1980', 'ln_msa_pop2022', 'ln_msa_pop1980',
       'medicare_share1980', 'medicare_share2022', 'change_medicare_share',
       'ln_aearn1980', 'ln_aearn2022', 'change_earnings', 'college1980',
       'college2022', 'change_college', 'healthcare_share_prime2022',
       'healthcare_share_prime1980', 'change_non_hc_share_lbfr',
       'change_ln_non_hc', 'non_hc_manu_share_prime_change', 'year', 'TOT_POP',
       'TOT_MALE', 'TOT_FEMALE', 'BAC_FEMALE', 'BAC_MALE', 'OTHER_FEMALE',
       'OTHER_MALE', 'WAC_FEMALE', 'WAC_MALE', 'annual_avg_estabs_count',
       'annual_avg_emplvl', 'total_annual_wages', 'annual_avg_wkly_wage'],
      dtype='object')

In [485]:
new_bfi_df.to_csv("../../data/bfi_pop_labor.csv", index=False)